#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.5.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class IntoTheRadius.AchievementsManager
	 * Size -> 0x0030 (FullSize[0x0058] - InheritedSize[0x0028])
	 */
	class UAchievementsManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_SRQV[0x30];                                  // 0x0028(0x0030) MISSED OFFSET (PADDING)

	public:
		void UpdateLeaderboardProgress(ERadiusLeaderboard Leaderboard, int32_t Value);
		void ResetAchievementProgress();
		void ReportAchievement(ERadiusAchievement Achievement, int32_t Value);
		void OnItemTaken(class UInventoryItem* Item);
		void OnItemBoughtEvent(class UInventoryItem* InventoryItem);
		void LogCachedAchievements();
		void Initialize();
		class UAchievementsManager* GetAchievementsManager();
		void CompleteAchievement(ERadiusAchievement Achievement);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.ActorActivationVolume
	 * Size -> 0x0018 (FullSize[0x02D0] - InheritedSize[0x02B8])
	 */
	class AActorActivationVolume : public AVolume
	{
	public:
		TArray<class AActorActivationVolume*>                      AdjacentVolumes;                                         // 0x02B8(0x0010) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_R5NM[0x8];                                   // 0x02C8(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.ActorActivationVolumeManager
	 * Size -> 0x0098 (FullSize[0x00C0] - InheritedSize[0x0028])
	 */
	class UActorActivationVolumeManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_MEXD[0x98];                                  // 0x0028(0x0098) MISSED OFFSET (PADDING)

	public:
		void OnTransitionStart();
		void OnLevelPrepare(const struct FGameplayTag& LevelTag);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.ActorVolumeActivationInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UActorVolumeActivationInterface : public UInterface
	{
	public:
		void SetVolumeActivationState(bool NewState);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.AIEdPerceptionComp
	 * Size -> 0x0000 (FullSize[0x01C0] - InheritedSize[0x01C0])
	 */
	class UAIEdPerceptionComp : public UAIPerceptionComponent
	{
	public:
		bool SetSightHalfAngle(float HalfAngle);
		bool SetSightDistance(float Distance);
		bool SetHearingDistance(float Distance);
		float GetSightHalfAngle();
		float GetSightDistance();
		float GetHearingDistance();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.AliveStatsComponent
	 * Size -> 0x00E8 (FullSize[0x01C8] - InheritedSize[0x00E0])
	 */
	class UAliveStatsComponent : public UActorComponent
	{
	public:
		float                                                      Health;                                                  // 0x00E0(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxHealth;                                               // 0x00E4(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRegeneration;                                           // 0x00E8(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WL8I[0x3];                                   // 0x00E9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxRegenHealth;                                          // 0x00EC(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegenerationSpeed;                                       // 0x00F0(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      RegenHealthLowLevel;                                     // 0x00F4(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bNoHealth;                                               // 0x00F8(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAutoRegeneration;                                       // 0x00F9(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowAutoRegeneration;                                  // 0x00FA(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLowHealth;                                              // 0x00FB(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Stamina;                                                 // 0x00FC(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StaminaMax;                                              // 0x0100(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StaminaSpeed;                                            // 0x0104(0x0004) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bStaminaUse;                                             // 0x0108(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bStaminaEnded;                                           // 0x0109(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLowStamina;                                             // 0x010A(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LJYD[0x5];                                   // 0x010B(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              OwnerActor;                                              // 0x0110(0x0008) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIgnoreNextAnyDamage;                                    // 0x0118(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TAKS[0x7];                                   // 0x0119(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AActor*                                              LastDamageCauser;                                        // 0x0120(0x0008) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        LastDamageByWeapon;                                      // 0x0128(0x0008) Edit, BlueprintVisible, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       LastDamageWithSmoothing;                                 // 0x0130(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_48R6[0x7];                                   // 0x0131(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              LastDamageByActor;                                       // 0x0138(0x0008) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CritBoneName;                                            // 0x0140(0x0008) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UObject*                                             CritComponent;                                           // 0x0148(0x0008) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bPrintStats;                                             // 0x0150(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCritsOnly;                                              // 0x0151(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanDie;                                                 // 0x0152(0x0001) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3DOJ[0x5];                                   // 0x0153(0x0005) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDamageType*                                         IgnoredDamageType;                                       // 0x0158(0x0008) Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnHungerEnd;                                             // 0x0160(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnHealthEnd;                                             // 0x0170(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnStaminaEnd;                                            // 0x0180(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnStaminaLow;                                            // 0x0190(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDamaged;                                               // 0x01A0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnChangeHealth;                                          // 0x01B0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WAY9[0x8];                                   // 0x01C0(0x0008) MISSED OFFSET (PADDING)

	public:
		void UseStamina(bool bUse, float UseSpeed);
		void OnTakePointDamage(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, const struct FVector& HitLocation, class UPrimitiveComponent* HitComponent, const class FName& BoneName, const struct FVector& ShotFromDirection, class UDamageType* DamageType, class AActor* DamageCauser);
		void OnTakeAnyDamage(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
		void Kill();
		bool IsCriticalHit(class UObject* HitComponent, const class FName& BoneName);
		bool IsAlive();
		void HealthRegeneration();
		float GetHealthPercent();
		void DisplayStats();
		void CustomTick();
		void ChangeHealth(float Value);
		void CalculateStamina(bool bUse);
		float ApplyDamage(class AActor* causer, class AActor* Weapon, float InputDamage);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.AmmoConfig
	 * Size -> 0x0098 (FullSize[0x00C8] - InheritedSize[0x0030])
	 */
	class UAmmoConfig : public UDataAsset
	{
	public:
		unsigned char                                              UnknownData_RZMG[0x30];                                  // 0x0030(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDataTable*                                          CommonInfoTable;                                         // 0x0060(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MeshPrimitiveDataIndex;                                  // 0x0068(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      ProjectileForwardSpawnOffset;                            // 0x006C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              BulletClassActor;                                        // 0x0070(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              GrenadeClassActor;                                       // 0x0078(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UClass*                                              ShrapnelClassActor;                                      // 0x0080(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                ShrapnelTags;                                            // 0x0088(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		class UClass*                                              ExplosionClassActor;                                     // 0x0098(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           AirExplosionShrapnelAccuracyRange;                       // 0x00A0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           AirExplosionBulletAccuracyRange;                         // 0x00A8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             ExplosionProjectilesOriginOffset;                        // 0x00B0(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             ExplosionProjectilesBoxExtend;                           // 0x00BC(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		void SetupAmmoMeshComponent(const struct FGameplayTag& AmmoTag, class UStaticMeshComponent* AmmoMeshComponent, bool IsFired);
		bool IsTakenOutAmmo(class AActor* Actor);
		bool IsShrapnelAmmo(const struct FGameplayTag& AmmoTag);
		bool IsHeldAmmo(class AActor* Actor);
		bool IsAmmo(class AActor* Actor);
		class UStaticMesh* GetAmmoWholeMesh(const struct FGameplayTag& AmmoType);
		class FText GetAmmoTypeName(const struct FGameplayTag& AmmoType);
		struct FLinearColor GetAmmoTypeColor(const struct FGameplayTag& AmmoType);
		class UAmmoConfig* GetAmmoTagsConfig();
		class UStaticMesh* GetAmmoShellMesh(const struct FGameplayTag& AmmoType);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.AnalyticsManager
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UAnalyticsManager : public UObject
	{
	public:
		void OnUnstuck(const struct FVector& Location);
		void OnTutorialStart(const struct FGameplayTag& TutorialId, int32_t TotalSteps);
		void OnTutorialEnd(const struct FGameplayTag& TutorialId, int32_t TotalSteps, int32_t CompletedSteps);
		void OnTutorialControls();
		void OnTransitionStart();
		void OnTideHappening();
		void OnSleep(float Seconds, bool isBlackout);
		void OnSettingsGameplay(bool VirtualStock, bool PlayerHeight, bool NeckHeight, bool ArmLength, bool VignetteTurn, bool VignetteRun, bool ShowBody, bool SeatedMode);
		void OnSettingsControls(bool bTurnType, bool bTurnSpeed, bool bMovementDirectionType, bool bControllerRotation, bool bHoldGrip, bool bLeftHanded, bool bMirrorHolsters, bool bTeleportMovement);
		void OnPlayerLocation(const struct FVector& Location, float AverageDelta);
		void OnPlayerKill(class AActor* KilledActor, const struct FGameplayTag& weaponTag, bool bIsSmoothing, const struct FVector& DeathLocation);
		void OnPlayerDeath(const class FText& DeathCauserName, const struct FVector& DeathLocation);
		void OnMoneyChanged(int32_t Value, TArray<class FString> AnalyticsParams);
		void OnMissionStateChanged(class UMissionData* MissionData);
		void OnMissionFinished(class UMissionData* MissionData);
		void OnMenuNewGame(bool SkipTutor, bool Ironman, const struct FRadiusGameDifficulty& Difficulty);
		void OnLogHmdDevice();
		void OnLogFPS(const class FString& Location, float Min, float Max, float Average);
		void OnLevelStarted(const struct FGameplayTag& Value);
		void OnKatyasMonologue(const struct FGameplayTag& MonologueTag);
		void OnJournalOpened(const struct FGameplayTag& TabTag);
		void OnGuitarPlayed(int32_t PlayCount, float PlayTimeSeconds);
		void OnGameStart();
		void OnFinalChoice(const class FString& Choice);
		void OnDifficultyChanged();
		void End();
		void Begin(class UPRGameInstance* GameInstance);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.AttachmentSlotComponent
	 * Size -> 0x0030 (FullSize[0x0540] - InheritedSize[0x0510])
	 */
	class UAttachmentSlotComponent : public UStaticMeshComponent
	{
	public:
		EItemSlot                                                  Slot;                                                    // 0x0510(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WBSC[0x3];                                   // 0x0511(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        AttachmentType;                                          // 0x0514(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                AttachToSocket;                                          // 0x051C(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P6SU[0x4];                                   // 0x0524(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UStaticMesh*                                         MyStaticMesh;                                            // 0x0528(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UBoxComponent*                                       BoxCollision;                                            // 0x0530(0x0008) Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QJ1N[0x8];                                   // 0x0538(0x0008) MISSED OFFSET (PADDING)

	public:
		void TryDetachItem(class AActor* Attachment, bool* bSuccess);
		void TryAttachItem(class AActor* Attachment, bool* bSuccess);
		void SetSlotEnabled(bool bEnable);
		bool IsSlotEnabled();
		bool IsSlotEmpty();
		void IsParentHeld(bool* IsHeld);
		void IsAccepts(const struct FGameplayTag& Type, bool* bCanAttach);
		class UInventoryItem* GetParentItem();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BackpackSimple
	 * Size -> 0x0020 (FullSize[0x0430] - InheritedSize[0x0410])
	 */
	class ABackpackSimple : public AGrippableStaticMeshActor
	{
	public:
		unsigned char                                              UnknownData_97O2[0x8];                                   // 0x0410(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class APRHolder*>                                   Holders;                                                 // 0x0418(0x0010) Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected
		unsigned char                                              UnknownData_62W7[0x8];                                   // 0x0428(0x0008) MISSED OFFSET (PADDING)

	public:
		void RefreshState();
		void OnUnequipped();
		void OnReturned();
		void LerpToHolster();
		class USceneComponent* GetPivotGripPoint();
		class APRHolder* GetHolderSleepingBag();
		TArray<class APRHolder*> GetHolders();
		class APRHolder* GetHolderPrimaryWeapon();
		class APRHolder* GetHolderBackpack();
		bool CheckEquipped();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BTD_BlackboardBool
	 * Size -> 0x0000 (FullSize[0x0090] - InheritedSize[0x0090])
	 */
	class UBTD_BlackboardBool : public UBTDecorator_BlackboardBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BTD_DistanceToCpp
	 * Size -> 0x0018 (FullSize[0x00F0] - InheritedSize[0x00D8])
	 */
	class UBTD_DistanceToCpp : public UBTDecorator_IsAtLocation
	{
	public:
		float                                                      RefreshInterval;                                         // 0x00D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E8E9[0x14];                                  // 0x00DC(0x0014) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BTD_IsActiveCpp
	 * Size -> 0x0008 (FullSize[0x0098] - InheritedSize[0x0090])
	 */
	class UBTD_IsActiveCpp : public UBTD_BlackboardBool
	{
	public:
		unsigned char                                              UnknownData_O46U[0x8];                                   // 0x0090(0x0008) MISSED OFFSET (PADDING)

	public:
		void OnNPCDied(class AActor* DeadNPC);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BTS_CheckLOS_Cpp
	 * Size -> 0x0020 (FullSize[0x00B8] - InheritedSize[0x0098])
	 */
	class UBTS_CheckLOS_Cpp : public UBTService_BlackboardBase
	{
	public:
		unsigned char                                              UnknownData_Y2TW[0x20];                                  // 0x0098(0x0020) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BTS_UpdateTargetLocation
	 * Size -> 0x0008 (FullSize[0x00A0] - InheritedSize[0x0098])
	 */
	class UBTS_UpdateTargetLocation : public UBTService_BlackboardBase
	{
	public:
		unsigned char                                              UnknownData_IV2O[0x8];                                   // 0x0098(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BTT_Bot_StartAttackCpp
	 * Size -> 0x0008 (FullSize[0x0078] - InheritedSize[0x0070])
	 */
	class UBTT_Bot_StartAttackCpp : public UBTTaskNode
	{
	public:
		unsigned char                                              UnknownData_2SM3[0x8];                                   // 0x0070(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.BTT_Bot_StopAttackCpp
	 * Size -> 0x0000 (FullSize[0x0070] - InheritedSize[0x0070])
	 */
	class UBTT_Bot_StopAttackCpp : public UBTTaskNode
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.PRBasicActor
	 * Size -> 0x0018 (FullSize[0x0298] - InheritedSize[0x0280])
	 */
	class APRBasicActor : public AActor
	{
	public:
		bool                                                       UseRelevanceManagement;                                  // 0x0280(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VIBJ[0x7];                                   // 0x0281(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FRelevanceDescription>                       RelevanceDescription;                                    // 0x0288(0x0010) Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, NativeAccessSpecifierPublic

	public:
		void OnTransitionStart();
		void OnTransitionEnd();
		void OnLevelStarted(const struct FGameplayTag& LevelTag);
		void OnLevelPrepare(const struct FGameplayTag& LevelTag);
		void OnGameStartedPrivate();
		void OnGameStarted();
		void OnGamePaused(bool bPaused);
		void DisableRelevanceManagement();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CharBroadcast
	 * Size -> 0x0020 (FullSize[0x02B8] - InheritedSize[0x0298])
	 */
	class ACharBroadcast : public APRBasicActor
	{
	public:
		unsigned char                                              UnknownData_Y60W[0x8];                                   // 0x0298(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USphereComponent*                                    Sphere;                                                  // 0x02A0(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		float                                                      Radius;                                                  // 0x02A8(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LifeTime;                                                // 0x02AC(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        MissionKillPoint;                                        // 0x02B0(0x0008) BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		class ACharBroadcast* SpawnBroadcast(class UObject* WorldContext, const struct FTransform& SpawnTransform, const struct FGameplayTag& MissionKillPointTag, float LifeSpan, float SphereRadius);
		void AlertOthers(class AActor* Caller, class AActor** Target, const struct FTransform& Location);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CheatsController
	 * Size -> 0x0010 (FullSize[0x02A8] - InheritedSize[0x0298])
	 */
	class ACheatsController : public APRBasicActor
	{
	public:
		unsigned char                                              UnknownData_PY9K[0x10];                                  // 0x0298(0x0010) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CheatsControllerInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UCheatsControllerInterface : public UInterface
	{
	public:
		bool SwitchPlayerCollisions();
		bool SwitchCheatShowStashes();
		bool SwitchCheatShowCorpses();
		bool SwitchCheatShowArtifacts();
		void SwitchCheatNoClip();
		void SetCheatScreenshot(bool bValue);
		void SetCheatReload(bool bValue);
		void SetCheatPause(bool bValue);
		void SetCheatNoRandom(bool bValue);
		bool GetCheatShowStashes();
		bool GetCheatShowCorpses();
		bool GetCheatShowArtifacts();
		bool GetCheatScreenshot();
		bool GetCheatReload();
		bool GetCheatPause();
		bool GetCheatNoRandom();
		bool GetCheatNoClip();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CloseCombatManager
	 * Size -> 0x00E0 (FullSize[0x0108] - InheritedSize[0x0028])
	 */
	class UCloseCombatManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_1TXZ[0x28];                                  // 0x0028(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FNpcInfo>                                    ManagedNpcList;                                          // 0x0050(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_VX9T[0x98];                                  // 0x0060(0x0098) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class APRPlayerCharacter*                                  PlayerRef;                                               // 0x00F8(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_4EEH[0x8];                                   // 0x0100(0x0008) MISSED OFFSET (PADDING)

	public:
		void UnregisterNpc(class ACharacter* NpcToUnregister);
		void ToggleDebug();
		void RegisterNpc(class ACharacter* NpcToRegister);
		void InitData();
		float GetTeleportSearchRadius();
		float GetMinDistanceFromPlayerToReappear();
		bool GetDebugEnabled();
		ENpcCombatState GetCloseCombatState(class ACharacter* NPC);
		class UCloseCombatManager* GetCloseCombatManager();
		void CleanData();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CoverBTTask
	 * Size -> 0x0098 (FullSize[0x0108] - InheritedSize[0x0070])
	 */
	class UCoverBTTask : public UBTTaskNode
	{
	public:
		unsigned char                                              UnknownData_C039[0x8];                                   // 0x0070(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBlackboardKeySelector                              OutputVector;                                            // 0x0078(0x0028) Edit, NativeAccessSpecifierPublic
		struct FBlackboardKeySelector                              TargetLocation;                                          // 0x00A0(0x0028) Edit, NativeAccessSpecifierPublic
		int32_t                                                    MaxSearchIteration;                                      // 0x00C8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SearchRadius;                                            // 0x00CC(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinDistanceToTarget;                                     // 0x00D0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDoPathLengthCheck;                                      // 0x00D4(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L2PN[0x3];                                   // 0x00D5(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxPathLength;                                           // 0x00D8(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDoSquadDistanceCheck;                                   // 0x00DC(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B3CU[0x3];                                   // 0x00DD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      MaxSquadDistance;                                        // 0x00E0(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_12AZ[0x4];                                   // 0x00E4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UBehaviorTreeComponent*                              BehaviorTreeComponent;                                   // 0x00E8(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_QFXC[0x18];                                  // 0x00F0(0x0018) MISSED OFFSET (PADDING)

	public:
		void OnQueryComplete(const struct FNpcPointQueryResult& Result);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.FindCoverBTTask
	 * Size -> 0x0000 (FullSize[0x0108] - InheritedSize[0x0108])
	 */
	class UFindCoverBTTask : public UCoverBTTask
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.FindShootingPositionBTTask
	 * Size -> 0x0000 (FullSize[0x0108] - InheritedSize[0x0108])
	 */
	class UFindShootingPositionBTTask : public UCoverBTTask
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CoverDebugComponent
	 * Size -> 0x0008 (FullSize[0x0230] - InheritedSize[0x0228])
	 */
	class UCoverDebugComponent : public USceneComponent
	{
	public:
		unsigned char                                              UnknownData_VN2X[0x8];                                   // 0x0228(0x0008) Fix Super Size

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CoverLoader
	 * Size -> 0x0030 (FullSize[0x02C8] - InheritedSize[0x0298])
	 */
	class ACoverLoader : public APRBasicActor
	{
	public:
		unsigned char                                              UnknownData_YKZ9[0x8];                                   // 0x0298(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UCoverDebugComponent*                                DebugComponent;                                          // 0x02A0(0x0008) Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		TArray<struct FVector>                                     CoverPoints;                                             // 0x02A8(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<struct FVector>                                     ShootingPositions;                                       // 0x02B8(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.CoverRuntimeDataHolder
	 * Size -> 0x01B8 (FullSize[0x01E0] - InheritedSize[0x0028])
	 */
	class UCoverRuntimeDataHolder : public UObject
	{
	public:
		unsigned char                                              UnknownData_81D0[0x1B8];                                 // 0x0028(0x01B8) MISSED OFFSET (PADDING)

	public:
		void ToggleDebug();
		void OnLevelUnloaded();
		bool GetDebugEnabled();
		class UCoverRuntimeDataHolder* GetCoverRuntimeDataHolder();
		void DebugDraw(class UObject* WorldContextObject);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.DamageDealerInterface
	 * Size -> 0x0000 (FullSize[0x0028] - InheritedSize[0x0028])
	 */
	class UDamageDealerInterface : public UInterface
	{
	public:
		struct FGameplayTag GetDamageDealerTag();
		class FText GetDamageDealerName();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.DataSaveManager
	 * Size -> 0x0070 (FullSize[0x0098] - InheritedSize[0x0028])
	 */
	class UDataSaveManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_52OJ[0x70];                                  // 0x0028(0x0070) MISSED OFFSET (PADDING)

	public:
		void SetUseAlternateSaveLocation(bool Value);
		bool SaveStringToFileEditor(const class FString& String, const class FString& FilePath, bool bAppend);
		bool SaveStringToFile(const class FString& String, const class FString& FilePath, bool bAppend);
		void SaveGameData(class UPRGameData* Data, int32_t SlotNr, int32_t SaveNr);
		bool IsSlotWithIronman(int32_t Slot);
		bool IsSlotEmpty(const struct FSaveSlotInfo& SlotInfo);
		bool HasSaves();
		bool GetUseAlternateSaveLocation();
		bool GetSlotInfo(int32_t Slot, struct FSaveSlotInfo* SlotInfo);
		class FString GetSavesPath();
		bool GetSaveInfo(int32_t Slot, int32_t Save, struct FSaveInfo* SaveInfo);
		struct FSaveInfo GetLastSaveInfo(const struct FSaveSlotInfo& SlotInfo);
		class UDataSaveManager* GetDataSaveManager();
		class FString GetDataPath();
		bool FixInventoryItemPosition(class UInventoryItem* Item);
		void CopyScopedToAlternateSave();
		void CopyAlternateToScopedSave();
		void AutosaveGameData(const class FString& Message);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.DiscordManager
	 * Size -> 0x0018 (FullSize[0x0040] - InheritedSize[0x0028])
	 */
	class UDiscordManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_P66U[0x18];                                  // 0x0028(0x0018) MISSED OFFSET (PADDING)

	public:
		void Initialize();
		class UDiscordManager* GetDiscordManager();
		void ChangeLocationName();
		void ChangeDifficulty();
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.DistanceGripManager
	 * Size -> 0x0078 (FullSize[0x00A0] - InheritedSize[0x0028])
	 */
	class UDistanceGripManager : public UObject
	{
	public:
		class APRPlayerCharacter*                                  GripSystemOwner;                                         // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_UODH[0x8];                                   // 0x0030(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TMap<class UInventoryItem*, struct FDistanceGripCandidate> CandidatePool;                                           // 0x0038(0x0050) ContainsInstancedReference, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_O94J[0x18];                                  // 0x0088(0x0018) MISSED OFFSET (PADDING)

	public:
		void LevelTransitionStartCallback();
		void LevelTransitionEndCallback();
		void ItemTakenFromLevelCallback(class UInventoryItem* ItemTaken);
		void ItemStoredToLevelCallback(class UInventoryItem* ItemStored);
		void ItemRemovedFromLevelCallback(class UInventoryItem* ItemRemoved);
		void ItemActorRemovedCallback(class UInventoryItem* ItemWithActorRemoved);
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.EnvConfigurator
	 * Size -> 0x0050 (FullSize[0x02E8] - InheritedSize[0x0298])
	 */
	class AEnvConfigurator : public APRBasicActor
	{
	public:
		struct FGameplayTag                                        LevelTag;                                                // 0x0298(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ADirectionalLight*                                   Sun;                                                     // 0x02A0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AActor*                                              Sky;                                                     // 0x02A8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ASkyLight*                                           SkyLight;                                                // 0x02B0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class AExponentialHeightFog*                               Fog;                                                     // 0x02B8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UParticleSystem*                                     RainParticles;                                           // 0x02C0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class ADirectionalLight*                                   ShadowLight;                                             // 0x02C8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveLinearColor*                                   ColorSun;                                                // 0x02D0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveLinearColor*                                   ColorFog;                                                // 0x02D8(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UCurveLinearColor*                                   ColorSky;                                                // 0x02E0(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class IntoTheRadius.EventsManager
	 * Size -> 0x0410 (FullSize[0x0438] - InheritedSize[0x0028])
	 */
	class UEventsManager : public UObject
	{
	public:
		unsigned char                                              UnknownData_69YN[0x10];                                  // 0x0028(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnGameInstanceStarted;                                   // 0x0038(0x0010) ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGameModeStarted;                                       // 0x0048(0x0010) ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerStarted;                                         // 0x0058(0x0010) ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGameStarted;                                           // 0x0068(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGameShutdown;                                          // 0x0078(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGameDataSave;                                          // 0x0088(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGameTimeChanged;                                       // 0x0098(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGameplayTimeDilationChanged;                           // 0x00A8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGamePaused;                                            // 0x00B8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnReferencesClearing;                                    // 0x00C8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnEnvironmentRePrepared;                                 // 0x00D8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTransitionStart;                                       // 0x00E8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTransitionStartOnce;                                   // 0x00F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTransitionEnd;                                         // 0x0108(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTransitionEndOnce;                                     // 0x0118(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnLevelPrepare;                                          // 0x0128(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnLevelPrepareOnce;                                      // 0x0138(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnLevelStarted;                                          // 0x0148(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnLevelStartedOnce;                                      // 0x0158(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemDropped;                                           // 0x0168(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemTaken;                                             // 0x0178(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemStored;                                            // 0x0188(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemsSold;                                             // 0x0198(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemBought;                                            // 0x01A8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerMoneyChanged;                                    // 0x01B8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemChangeDurability;                                  // 0x01C8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerLevelChanged;                                    // 0x01D8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnInventoryModeChanged;                                  // 0x01E8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemRemoved;                                           // 0x01F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnItemActorRefRemoved;                                   // 0x0208(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnFirstTimeTaken;                                        // 0x0218(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnNewMissionAdded;                                       // 0x0228(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnMissionPreview;                                        // 0x0238(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnMissionFinished;                                       // 0x0248(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnMissionStateChanged;                                   // 0x0258(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnObjectiveFinished;                                     // 0x0268(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnObjectiveRestored;                                     // 0x0278(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnObjectiveProgress;                                     // 0x0288(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTutorialSequenceFinished;                              // 0x0298(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerKilledNPC;                                       // 0x02A8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnNPCDied;                                               // 0x02B8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnWildSpawnerCleared;                                    // 0x02C8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPictureTaken;                                          // 0x02D8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnStashOpened;                                           // 0x02E8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTriggerPassed;                                         // 0x02F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTriggerUnset;                                          // 0x0308(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnStoryNotePassed;                                       // 0x0318(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnCustomMapMarkPassed;                                   // 0x0328(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnNewJournalNote;                                        // 0x0338(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnConsumableUsing;                                       // 0x0348(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnShotFired;                                             // 0x0358(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTutorialStarted;                                       // 0x0368(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTideHappening;                                         // 0x0378(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDifficultyChanged;                                     // 0x0388(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnVirtualStockChanged;                                   // 0x0398(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnShowBodyChanged;                                       // 0x03A8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerReset;                                           // 0x03B8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerDied;                                            // 0x03C8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerEyesOpen;                                        // 0x03D8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerSleep;                                           // 0x03E8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerTurning;                                         // 0x03F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerWalking;                                         // 0x0408(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerRunning;                                         // 0x0418(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnPlayerBodyVisibilityChanged;                           // 0x0428(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic

	public:
		class UEventsManager* GetEventsManager();
		void FireOnWildSpawnerCleared(class AActor* SpawnerActor);
		void FireOnVirtualStockChanged();
		void FireOnTutorialStarted(const struct FGameplayTag& TutorialId);
		void FireOnTutorialSequenceFinished(class AActor* SequenceActor);
		void FireOnTriggerUnset(const struct FGameplayTag& Trigger);
		void FireOnTriggerPassed(const struct FGameplayTag& Trigger);
		void FireOnTransitionStart();
		void FireOnTransitionEnd();
		void FireOnTideHappening();
		void FireOnStoryNotePassed(const struct FGameplayTag& NoteID);
		void FireOnStashOpened(class AActor* StashActor);
		void FireOnShowBodyChanged();
		void FireOnShotFired();
		void FireOnReferencesClearing();
		void FireOnPlayerWalking();
		void FireOnPlayerTurning();
		void FireOnPlayerStarted();
		void FireOnPlayerSleep(float Seconds, bool bIsBlackout);
		void FireOnPlayerRunning();
