#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.5.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function IntoTheRadius.AchievementsManager.UpdateLeaderboardProgress
	 */
	struct UAchievementsManager_UpdateLeaderboardProgress_Params
	{
	public:
		ERadiusLeaderboard                                         Leaderboard;                                             // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_FZNP[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    Value;                                                   // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AchievementsManager.ResetAchievementProgress
	 */
	struct UAchievementsManager_ResetAchievementProgress_Params
	{	};

	/**
	 * Function IntoTheRadius.AchievementsManager.ReportAchievement
	 */
	struct UAchievementsManager_ReportAchievement_Params
	{
	public:
		ERadiusAchievement                                         Achievement;                                             // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MEKA[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		int32_t                                                    Value;                                                   // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AchievementsManager.OnItemTaken
	 */
	struct UAchievementsManager_OnItemTaken_Params
	{
	public:
		class UInventoryItem*                                      Item;                                                    // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AchievementsManager.OnItemBoughtEvent
	 */
	struct UAchievementsManager_OnItemBoughtEvent_Params
	{
	public:
		class UInventoryItem*                                      InventoryItem;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AchievementsManager.LogCachedAchievements
	 */
	struct UAchievementsManager_LogCachedAchievements_Params
	{	};

	/**
	 * Function IntoTheRadius.AchievementsManager.Initialize
	 */
	struct UAchievementsManager_Initialize_Params
	{	};

	/**
	 * Function IntoTheRadius.AchievementsManager.GetAchievementsManager
	 */
	struct UAchievementsManager_GetAchievementsManager_Params
	{
	public:
		class UAchievementsManager*                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AchievementsManager.CompleteAchievement
	 */
	struct UAchievementsManager_CompleteAchievement_Params
	{
	public:
		ERadiusAchievement                                         Achievement;                                             // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.ActorActivationVolumeManager.OnTransitionStart
	 */
	struct UActorActivationVolumeManager_OnTransitionStart_Params
	{	};

	/**
	 * Function IntoTheRadius.ActorActivationVolumeManager.OnLevelPrepare
	 */
	struct UActorActivationVolumeManager_OnLevelPrepare_Params
	{
	public:
		struct FGameplayTag                                        LevelTag;                                                // 0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.ActorVolumeActivationInterface.SetVolumeActivationState
	 */
	struct UActorVolumeActivationInterface_SetVolumeActivationState_Params
	{
	public:
		bool                                                       NewState;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AIEdPerceptionComp.SetSightHalfAngle
	 */
	struct UAIEdPerceptionComp_SetSightHalfAngle_Params
	{
	public:
		float                                                      HalfAngle;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AIEdPerceptionComp.SetSightDistance
	 */
	struct UAIEdPerceptionComp_SetSightDistance_Params
	{
	public:
		float                                                      Distance;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AIEdPerceptionComp.SetHearingDistance
	 */
	struct UAIEdPerceptionComp_SetHearingDistance_Params
	{
	public:
		float                                                      Distance;                                                // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AIEdPerceptionComp.GetSightHalfAngle
	 */
	struct UAIEdPerceptionComp_GetSightHalfAngle_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AIEdPerceptionComp.GetSightDistance
	 */
	struct UAIEdPerceptionComp_GetSightDistance_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AIEdPerceptionComp.GetHearingDistance
	 */
	struct UAIEdPerceptionComp_GetHearingDistance_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.UseStamina
	 */
	struct UAliveStatsComponent_UseStamina_Params
	{
	public:
		bool                                                       bUse;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_6W1X[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      UseSpeed;                                                // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.OnTakePointDamage
	 */
	struct UAliveStatsComponent_OnTakePointDamage_Params
	{
	public:
		class AActor*                                              DamagedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Damage;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_QFAT[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class AController*                                         InstigatedBy;                                            // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             HitLocation;                                             // 0x0018(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_VYJ2[0x4];                                   // 0x0024(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UPrimitiveComponent*                                 HitComponent;                                            // 0x0028(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                BoneName;                                                // 0x0030(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             ShotFromDirection;                                       // 0x0038(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_ICM7[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UDamageType*                                         DamageType;                                              // 0x0048(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              DamageCauser;                                            // 0x0050(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.OnTakeAnyDamage
	 */
	struct UAliveStatsComponent_OnTakeAnyDamage_Params
	{
	public:
		class AActor*                                              DamagedActor;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Damage;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_CLV3[0x4];                                   // 0x000C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UDamageType*                                         DamageType;                                              // 0x0010(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AController*                                         InstigatedBy;                                            // 0x0018(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              DamageCauser;                                            // 0x0020(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.Kill
	 */
	struct UAliveStatsComponent_Kill_Params
	{	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.IsCriticalHit
	 */
	struct UAliveStatsComponent_IsCriticalHit_Params
	{
	public:
		class UObject*                                             HitComponent;                                            // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                BoneName;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.IsAlive
	 */
	struct UAliveStatsComponent_IsAlive_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.HealthRegeneration
	 */
	struct UAliveStatsComponent_HealthRegeneration_Params
	{	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.GetHealthPercent
	 */
	struct UAliveStatsComponent_GetHealthPercent_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.DisplayStats
	 */
	struct UAliveStatsComponent_DisplayStats_Params
	{	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.CustomTick
	 */
	struct UAliveStatsComponent_CustomTick_Params
	{	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.ChangeHealth
	 */
	struct UAliveStatsComponent_ChangeHealth_Params
	{
	public:
		float                                                      Value;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.CalculateStamina
	 */
	struct UAliveStatsComponent_CalculateStamina_Params
	{
	public:
		bool                                                       bUse;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AliveStatsComponent.ApplyDamage
	 */
	struct UAliveStatsComponent_ApplyDamage_Params
	{
	public:
		class AActor*                                              causer;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Weapon;                                                  // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      InputDamage;                                             // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0014(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.SetupAmmoMeshComponent
	 */
	struct UAmmoConfig_SetupAmmoMeshComponent_Params
	{
	public:
		struct FGameplayTag                                        AmmoTag;                                                 // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UStaticMeshComponent*                                AmmoMeshComponent;                                       // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsFired;                                                 // 0x0010(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.IsTakenOutAmmo
	 */
	struct UAmmoConfig_IsTakenOutAmmo_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.IsShrapnelAmmo
	 */
	struct UAmmoConfig_IsShrapnelAmmo_Params
	{
	public:
		struct FGameplayTag                                        AmmoTag;                                                 // 0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.IsHeldAmmo
	 */
	struct UAmmoConfig_IsHeldAmmo_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.IsAmmo
	 */
	struct UAmmoConfig_IsAmmo_Params
	{
	public:
		class AActor*                                              Actor;                                                   // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.GetAmmoWholeMesh
	 */
	struct UAmmoConfig_GetAmmoWholeMesh_Params
	{
	public:
		struct FGameplayTag                                        AmmoType;                                                // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UStaticMesh*                                         ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.GetAmmoTypeName
	 */
	struct UAmmoConfig_GetAmmoTypeName_Params
	{
	public:
		struct FGameplayTag                                        AmmoType;                                                // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FText                                                ReturnValue;                                             // 0x0008(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.GetAmmoTypeColor
	 */
	struct UAmmoConfig_GetAmmoTypeColor_Params
	{
	public:
		struct FGameplayTag                                        AmmoType;                                                // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FLinearColor                                        ReturnValue;                                             // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.GetAmmoTagsConfig
	 */
	struct UAmmoConfig_GetAmmoTagsConfig_Params
	{
	public:
		class UAmmoConfig*                                         ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AmmoConfig.GetAmmoShellMesh
	 */
	struct UAmmoConfig_GetAmmoShellMesh_Params
	{
	public:
		struct FGameplayTag                                        AmmoType;                                                // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UStaticMesh*                                         ReturnValue;                                             // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnUnstuck
	 */
	struct UAnalyticsManager_OnUnstuck_Params
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnTutorialStart
	 */
	struct UAnalyticsManager_OnTutorialStart_Params
	{
	public:
		struct FGameplayTag                                        TutorialId;                                              // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    TotalSteps;                                              // 0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnTutorialEnd
	 */
	struct UAnalyticsManager_OnTutorialEnd_Params
	{
	public:
		struct FGameplayTag                                        TutorialId;                                              // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    TotalSteps;                                              // 0x0008(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CompletedSteps;                                          // 0x000C(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnTutorialControls
	 */
	struct UAnalyticsManager_OnTutorialControls_Params
	{	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnTransitionStart
	 */
	struct UAnalyticsManager_OnTransitionStart_Params
	{	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnTideHappening
	 */
	struct UAnalyticsManager_OnTideHappening_Params
	{	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnSleep
	 */
	struct UAnalyticsManager_OnSleep_Params
	{
	public:
		float                                                      Seconds;                                                 // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       isBlackout;                                              // 0x0004(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnSettingsGameplay
	 */
	struct UAnalyticsManager_OnSettingsGameplay_Params
	{
	public:
		bool                                                       VirtualStock;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       PlayerHeight;                                            // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       NeckHeight;                                              // 0x0002(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ArmLength;                                               // 0x0003(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       VignetteTurn;                                            // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       VignetteRun;                                             // 0x0005(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ShowBody;                                                // 0x0006(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       SeatedMode;                                              // 0x0007(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnSettingsControls
	 */
	struct UAnalyticsManager_OnSettingsControls_Params
	{
	public:
		bool                                                       bTurnType;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bTurnSpeed;                                              // 0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bMovementDirectionType;                                  // 0x0002(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bControllerRotation;                                     // 0x0003(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bHoldGrip;                                               // 0x0004(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bLeftHanded;                                             // 0x0005(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bMirrorHolsters;                                         // 0x0006(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bTeleportMovement;                                       // 0x0007(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnPlayerLocation
	 */
	struct UAnalyticsManager_OnPlayerLocation_Params
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      AverageDelta;                                            // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnPlayerKill
	 */
	struct UAnalyticsManager_OnPlayerKill_Params
	{
	public:
		class AActor*                                              KilledActor;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGameplayTag                                        weaponTag;                                               // 0x0008(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsSmoothing;                                            // 0x0010(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_175A[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FVector                                             DeathLocation;                                           // 0x0014(0x000C)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnPlayerDeath
	 */
	struct UAnalyticsManager_OnPlayerDeath_Params
	{
	public:
		class FText                                                DeathCauserName;                                         // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		struct FVector                                             DeathLocation;                                           // 0x0018(0x000C)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnMoneyChanged
	 */
	struct UAnalyticsManager_OnMoneyChanged_Params
	{
	public:
		int32_t                                                    Value;                                                   // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_WKDA[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		TArray<class FString>                                      AnalyticsParams;                                         // 0x0008(0x0010)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnMissionStateChanged
	 */
	struct UAnalyticsManager_OnMissionStateChanged_Params
	{
	public:
		class UMissionData*                                        MissionData;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnMissionFinished
	 */
	struct UAnalyticsManager_OnMissionFinished_Params
	{
	public:
		class UMissionData*                                        MissionData;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnMenuNewGame
	 */
	struct UAnalyticsManager_OnMenuNewGame_Params
	{
	public:
		bool                                                       SkipTutor;                                               // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       Ironman;                                                 // 0x0001(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FRadiusGameDifficulty                               Difficulty;                                              // 0x0002(0x0010)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnLogHmdDevice
	 */
	struct UAnalyticsManager_OnLogHmdDevice_Params
	{	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnLogFPS
	 */
	struct UAnalyticsManager_OnLogFPS_Params
	{
	public:
		class FString                                              Location;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Min;                                                     // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Max;                                                     // 0x0014(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Average;                                                 // 0x0018(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnLevelStarted
	 */
	struct UAnalyticsManager_OnLevelStarted_Params
	{
	public:
		struct FGameplayTag                                        Value;                                                   // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnKatyasMonologue
	 */
	struct UAnalyticsManager_OnKatyasMonologue_Params
	{
	public:
		struct FGameplayTag                                        MonologueTag;                                            // 0x0000(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnJournalOpened
	 */
	struct UAnalyticsManager_OnJournalOpened_Params
	{
	public:
		struct FGameplayTag                                        TabTag;                                                  // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnGuitarPlayed
	 */
	struct UAnalyticsManager_OnGuitarPlayed_Params
	{
	public:
		int32_t                                                    PlayCount;                                               // 0x0000(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      PlayTimeSeconds;                                         // 0x0004(0x0004)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnGameStart
	 */
	struct UAnalyticsManager_OnGameStart_Params
	{	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnFinalChoice
	 */
	struct UAnalyticsManager_OnFinalChoice_Params
	{
	public:
		class FString                                              Choice;                                                  // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.OnDifficultyChanged
	 */
	struct UAnalyticsManager_OnDifficultyChanged_Params
	{	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.End
	 */
	struct UAnalyticsManager_End_Params
	{	};

	/**
	 * Function IntoTheRadius.AnalyticsManager.Begin
	 */
	struct UAnalyticsManager_Begin_Params
	{
	public:
		class UPRGameInstance*                                     GameInstance;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.TryDetachItem
	 */
	struct UAttachmentSlotComponent_TryDetachItem_Params
	{
	public:
		class AActor*                                              Attachment;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bSuccess;                                                // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.TryAttachItem
	 */
	struct UAttachmentSlotComponent_TryAttachItem_Params
	{
	public:
		class AActor*                                              Attachment;                                              // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bSuccess;                                                // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.SetSlotEnabled
	 */
	struct UAttachmentSlotComponent_SetSlotEnabled_Params
	{
	public:
		bool                                                       bEnable;                                                 // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.IsSlotEnabled
	 */
	struct UAttachmentSlotComponent_IsSlotEnabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.IsSlotEmpty
	 */
	struct UAttachmentSlotComponent_IsSlotEmpty_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.IsParentHeld
	 */
	struct UAttachmentSlotComponent_IsParentHeld_Params
	{
	public:
		bool                                                       IsHeld;                                                  // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.IsAccepts
	 */
	struct UAttachmentSlotComponent_IsAccepts_Params
	{
	public:
		struct FGameplayTag                                        Type;                                                    // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bCanAttach;                                              // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.AttachmentSlotComponent.GetParentItem
	 */
	struct UAttachmentSlotComponent_GetParentItem_Params
	{
	public:
		class UInventoryItem*                                      ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.BackpackSimple.RefreshState
	 */
	struct ABackpackSimple_RefreshState_Params
	{	};

	/**
	 * Function IntoTheRadius.BackpackSimple.OnUnequipped
	 */
	struct ABackpackSimple_OnUnequipped_Params
	{	};

	/**
	 * Function IntoTheRadius.BackpackSimple.OnReturned
	 */
	struct ABackpackSimple_OnReturned_Params
	{	};

	/**
	 * Function IntoTheRadius.BackpackSimple.LerpToHolster
	 */
	struct ABackpackSimple_LerpToHolster_Params
	{	};

	/**
	 * Function IntoTheRadius.BackpackSimple.GetPivotGripPoint
	 */
	struct ABackpackSimple_GetPivotGripPoint_Params
	{
	public:
		class USceneComponent*                                     ReturnValue;                                             // 0x0000(0x0008)  (ConstParm, ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.BackpackSimple.GetHolderSleepingBag
	 */
	struct ABackpackSimple_GetHolderSleepingBag_Params
	{
	public:
		class APRHolder*                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.BackpackSimple.GetHolders
	 */
	struct ABackpackSimple_GetHolders_Params
	{
	public:
		TArray<class APRHolder*>                                   ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.BackpackSimple.GetHolderPrimaryWeapon
	 */
	struct ABackpackSimple_GetHolderPrimaryWeapon_Params
	{
	public:
		class APRHolder*                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.BackpackSimple.GetHolderBackpack
	 */
	struct ABackpackSimple_GetHolderBackpack_Params
	{
	public:
		class APRHolder*                                           ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.BackpackSimple.CheckEquipped
	 */
	struct ABackpackSimple_CheckEquipped_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.BTD_IsActiveCpp.OnNPCDied
	 */
	struct UBTD_IsActiveCpp_OnNPCDied_Params
	{
	public:
		class AActor*                                              DeadNPC;                                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.PRBasicActor.OnTransitionStart
	 */
	struct APRBasicActor_OnTransitionStart_Params
	{	};

	/**
	 * Function IntoTheRadius.PRBasicActor.OnTransitionEnd
	 */
	struct APRBasicActor_OnTransitionEnd_Params
	{	};

	/**
	 * Function IntoTheRadius.PRBasicActor.OnLevelStarted
	 */
	struct APRBasicActor_OnLevelStarted_Params
	{
	public:
		struct FGameplayTag                                        LevelTag;                                                // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.PRBasicActor.OnLevelPrepare
	 */
	struct APRBasicActor_OnLevelPrepare_Params
	{
	public:
		struct FGameplayTag                                        LevelTag;                                                // 0x0000(0x0008)  (ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.PRBasicActor.OnGameStartedPrivate
	 */
	struct APRBasicActor_OnGameStartedPrivate_Params
	{	};

	/**
	 * Function IntoTheRadius.PRBasicActor.OnGameStarted
	 */
	struct APRBasicActor_OnGameStarted_Params
	{	};

	/**
	 * Function IntoTheRadius.PRBasicActor.OnGamePaused
	 */
	struct APRBasicActor_OnGamePaused_Params
	{
	public:
		bool                                                       bPaused;                                                 // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.PRBasicActor.DisableRelevanceManagement
	 */
	struct APRBasicActor_DisableRelevanceManagement_Params
	{	};

	/**
	 * Function IntoTheRadius.CharBroadcast.SpawnBroadcast
	 */
	struct ACharBroadcast_SpawnBroadcast_Params
	{
	public:
		class UObject*                                             WorldContext;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_JAJO[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          SpawnTransform;                                          // 0x0010(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		struct FGameplayTag                                        MissionKillPointTag;                                     // 0x0040(0x0008)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      LifeSpan;                                                // 0x0048(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      SphereRadius;                                            // 0x004C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class ACharBroadcast*                                      ReturnValue;                                             // 0x0050(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CharBroadcast.AlertOthers
	 */
	struct ACharBroadcast_AlertOthers_Params
	{
	public:
		class AActor*                                              Caller;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class AActor*                                              Target;                                                  // 0x0008(0x0008)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FTransform                                          Location;                                                // 0x0010(0x0030)  (Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SwitchPlayerCollisions
	 */
	struct UCheatsControllerInterface_SwitchPlayerCollisions_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SwitchCheatShowStashes
	 */
	struct UCheatsControllerInterface_SwitchCheatShowStashes_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SwitchCheatShowCorpses
	 */
	struct UCheatsControllerInterface_SwitchCheatShowCorpses_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SwitchCheatShowArtifacts
	 */
	struct UCheatsControllerInterface_SwitchCheatShowArtifacts_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SwitchCheatNoClip
	 */
	struct UCheatsControllerInterface_SwitchCheatNoClip_Params
	{	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SetCheatScreenshot
	 */
	struct UCheatsControllerInterface_SetCheatScreenshot_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SetCheatReload
	 */
	struct UCheatsControllerInterface_SetCheatReload_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SetCheatPause
	 */
	struct UCheatsControllerInterface_SetCheatPause_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.SetCheatNoRandom
	 */
	struct UCheatsControllerInterface_SetCheatNoRandom_Params
	{
	public:
		bool                                                       bValue;                                                  // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatShowStashes
	 */
	struct UCheatsControllerInterface_GetCheatShowStashes_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatShowCorpses
	 */
	struct UCheatsControllerInterface_GetCheatShowCorpses_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatShowArtifacts
	 */
	struct UCheatsControllerInterface_GetCheatShowArtifacts_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatScreenshot
	 */
	struct UCheatsControllerInterface_GetCheatScreenshot_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatReload
	 */
	struct UCheatsControllerInterface_GetCheatReload_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatPause
	 */
	struct UCheatsControllerInterface_GetCheatPause_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatNoRandom
	 */
	struct UCheatsControllerInterface_GetCheatNoRandom_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CheatsControllerInterface.GetCheatNoClip
	 */
	struct UCheatsControllerInterface_GetCheatNoClip_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.UnregisterNpc
	 */
	struct UCloseCombatManager_UnregisterNpc_Params
	{
	public:
		class ACharacter*                                          NpcToUnregister;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.ToggleDebug
	 */
	struct UCloseCombatManager_ToggleDebug_Params
	{	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.RegisterNpc
	 */
	struct UCloseCombatManager_RegisterNpc_Params
	{
	public:
		class ACharacter*                                          NpcToRegister;                                           // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.InitData
	 */
	struct UCloseCombatManager_InitData_Params
	{	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.GetTeleportSearchRadius
	 */
	struct UCloseCombatManager_GetTeleportSearchRadius_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.GetMinDistanceFromPlayerToReappear
	 */
	struct UCloseCombatManager_GetMinDistanceFromPlayerToReappear_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.GetDebugEnabled
	 */
	struct UCloseCombatManager_GetDebugEnabled_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function IntoTheRadius.CloseCombatManager.GetCloseCombatState
	 */
