#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.5.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * UserDefinedStruct Mantle_Asset.Mantle_Asset
	 * Size -> 0x0034
	 */
	struct FMantle_Asset_FMantle_Asset
	{
	public:
		class UAnimMontage*                                        AnimMontage_42_63D6D9044A5DAB0EFBDC858CD9E37736;         // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		class UCurveVector*                                        PositionCorrectionCurve_43_0A4924AE48051202994680A7CE2D2C3A; // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             StartingOffset_30_FA0FF9D34F3BA3C50CF7C3928E516172;      // 0x0010(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LowHeight_21_5CC2462A4191A12ECA9BDE85FA26C424;           // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LowPlayRate_37_391A50444B0AD0F7DD66A9BE9C6C65CA;         // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      LowStartPosition_22_17AF0D8346D9E966FE520FB93F149B66;    // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      HighHeight_23_8A8982FC42C3B6CDF79429B8675C86D9;          // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      HighPlayRate_39_7ABB38D5459C2FE20D6A24AB7820B2FD;        // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		float                                                      HighStartPosition_24_D005813041B0EAEEB90490A469911497;   // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
