#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.5.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class VRExpansionPlugin.BucketUpdateSubsystem
	 * Size -> 0x0060 (FullSize[0x0090] - InheritedSize[0x0030])
	 */
	class UBucketUpdateSubsystem : public UEngineSubsystem
	{
	public:
		unsigned char                                              UnknownData_JH4A[0x60];                                  // 0x0030(0x0060) MISSED OFFSET (PADDING)

	public:
		bool RemoveObjectFromBucketByFunctionName(class UObject* InObject, const class FName& FunctionName);
		bool RemoveObjectFromBucketByEvent(const class FScriptDelegate& Delegate);
		bool RemoveObjectFromAllBuckets(class UObject* InObject);
		bool K2_AddObjectToBucket(int32_t UpdateHTZ, class UObject* InObject, const class FName& FunctionName);
		bool K2_AddObjectEventToBucket(const class FScriptDelegate& Delegate, int32_t UpdateHTZ);
		bool IsObjectFunctionInBucket(class UObject* InObject, const class FName& FunctionName);
		bool IsActive();
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GripMotionControllerComponent
	 * Size -> 0x04F0 (FullSize[0x0A30] - InheritedSize[0x0540])
	 */
	class UGripMotionControllerComponent : public UMotionControllerComponent
	{
	public:
		unsigned char                                              UnknownData_XOOD[0x28];                                  // 0x0540(0x0028) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UClass*                                              DefaultGripScriptClass;                                  // 0x0568(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UVRGripScriptBase*                                   DefaultGripScript;                                       // 0x0570(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnLerpToHandFinished;                                    // 0x0578(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		bool                                                       bOffsetByHMD;                                            // 0x0588(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bConstrainToPivot;                                       // 0x0589(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GXHO[0x2];                                   // 0x058A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TWeakObjectPtr<class AVRBaseCharacter>                     AttachChar;                                              // 0x058C(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2C6G[0x3C];                                  // 0x0594(0x003C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bSmoothHandTracking;                                     // 0x05D0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9R0Q[0x1];                                   // 0x05D1(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bSmoothWithEuroLowPassFunction;                          // 0x05D2(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VZAY[0x1];                                   // 0x05D3(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      SmoothingSpeed;                                          // 0x05D4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4USK[0x8];                                   // 0x05D8(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPEuroLowPassFilterTrans                           EuroSmoothingParams;                                     // 0x05E0(0x0150) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0PU1[0x30];                                  // 0x0730(0x0030) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		EVRVelocityType                                            VelocityCalculationType;                                 // 0x0760(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSampleVelocityInWorldSpace;                             // 0x0761(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LP6Q[0x2];                                   // 0x0762(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    VelocitySamples;                                         // 0x0764(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VV6K[0x20];                                  // 0x0768(0x0020) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bOffsetByControllerProfile;                              // 0x0788(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KBTE[0x37];                                  // 0x0789(0x0037) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnControllerProfileTransformChanged;                     // 0x07C0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripOutOfRange;                                        // 0x07D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FVector                                             LastGripRootLocation;                                    // 0x07E0(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MaxHandDistanceInGrip;                                   // 0x07EC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FTransform                                          LastHandOffsetTransform;                                 // 0x07F0(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       bHasSecondControllerAttachment;                          // 0x0820(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OOXO[0x7];                                   // 0x0821(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UGripMotionControllerComponent*                      SecondController;                                        // 0x0828(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bLerpGrip;                                               // 0x0830(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanUseDistanceHandLimits;                               // 0x0831(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JO4Z[0x86];                                  // 0x0832(0x0086) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FScriptMulticastDelegate                             OnTrackingChanged;                                       // 0x08B8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGrippedObject;                                         // 0x08C8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDroppedObject;                                         // 0x08D8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnTeleportedGrips;                                       // 0x08E8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x08F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x0908(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripTransformChanged;                                  // 0x0918(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		TWeakObjectPtr<class USceneComponent>                      CustomPivotComponent;                                    // 0x0928(0x0008) Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                CustomPivotComponentSocketName;                          // 0x0930(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bSkipPivotTransformAdjustment;                           // 0x0938(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0ZLO[0x7];                                   // 0x0939(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct FBPActorGripInformation>                     GrippedObjects;                                          // 0x0940(0x0010) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<struct FBPActorGripInformation>                     LocallyGrippedObjects;                                   // 0x0950(0x0010) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<struct FBPActorGripInformation>                     LocalTransactionBuffer;                                  // 0x0960(0x0010) BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic
		bool                                                       bAlwaysSendTickGrip;                                     // 0x0970(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SKWU[0x7];                                   // 0x0971(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UPrimitiveComponent*>                         AdditionalLateUpdateComponents;                          // 0x0978(0x0010) BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		struct FBPVRComponentPosRep                                ReplicatedControllerTransform;                           // 0x0988(0x001C) Edit, Net, DisableEditOnInstance, RepNotify, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QBNA[0x1C];                                  // 0x09A4(0x001C) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      ControllerNetUpdateRate;                                 // 0x09C0(0x0004) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EDGU[0x4];                                   // 0x09C4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bSmoothReplicatedMotion;                                 // 0x09C8(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReplicateWithoutTracking;                               // 0x09C9(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E0AW[0x1E];                                  // 0x09CA(0x001E) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UObject*>                                     ObjectsWaitingForSocketUpdate;                           // 0x09E8(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_988D[0x1];                                   // 0x09F8(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bUseWithoutTracking;                                     // 0x09F9(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BDPT[0x36];                                  // 0x09FA(0x0036) MISSED OFFSET (PADDING)

	public:
		void UpdatePhysicsHandleTransform_BP(const struct FBPActorGripInformation& GrippedActor, const struct FTransform& NewTransform);
		bool UpdatePhysicsHandle_BP(const struct FBPActorGripInformation& Grip, bool bFullyRecreate);
		void TeleportMoveGrips(bool bTeleportPhysicsGrips, bool bIsForPostTeleport);
		bool TeleportMoveGrippedComponent(class UPrimitiveComponent* ComponentToMove, bool bTeleportPhysicsGrips);
		bool TeleportMoveGrippedActor(class AActor* GrippedActorToMove, bool bTeleportPhysicsGrips);
		bool TeleportMoveGrip(struct FBPActorGripInformation* Grip, bool bTeleportPhysicsGrips, bool bIsForPostTeleport);
		bool SetUpPhysicsHandle_BP(const struct FBPActorGripInformation& Grip);
		void SetSocketTransform(class UObject* ObjectToSocket, const struct FTransform_NetQuantize& RelativeTransformToParent);
		bool SetPhysicsHandleSettings(const struct FBPActorGripInformation& Grip, const struct FBPAdvancedPhysicsHandleSettings& PhysicsHandleSettingsIn);
		void SetPausedTransform(const struct FBPActorGripInformation& Grip, const struct FTransform& PausedTransform, bool bTeleport);
		void SetGripStiffnessAndDamping(const struct FBPActorGripInformation& Grip, EBPVRResultSwitch* Result, float NewStiffness, float NewDamping, bool bAlsoSetAngularValues, float OptionalAngularStiffness, float OptionalAngularDamping);
		void SetGripRelativeTransform(const struct FBPActorGripInformation& Grip, EBPVRResultSwitch* Result, const struct FTransform& NewRelativeTransform);
		void SetGripPaused(const struct FBPActorGripInformation& Grip, EBPVRResultSwitch* Result, bool bIsPaused, bool bNoConstraintWhenPaused);
		void SetGripLateUpdateSetting(const struct FBPActorGripInformation& Grip, EBPVRResultSwitch* Result, EGripLateUpdateSettings NewGripLateUpdateSetting);
		void SetGripHybridLock(const struct FBPActorGripInformation& Grip, EBPVRResultSwitch* Result, bool bIsLocked);
		void SetGripCollisionType(const struct FBPActorGripInformation& Grip, EBPVRResultSwitch* Result, EGripCollisionType NewGripCollisionType);
		void SetGripAdditionTransform(const struct FBPActorGripInformation& Grip, EBPVRResultSwitch* Result, const struct FTransform& NewAdditionTransform, bool bMakeGripRelative);
		void SetCustomPivotComponent(class USceneComponent* NewCustomPivotComponent, const class FName& PivotSocketName);
		void Server_SendControllerTransform(const struct FBPVRComponentPosRep& NewTransform);
		void Server_NotifySecondaryAttachmentChanged_Retain(unsigned char GripID, const struct FBPSecondaryGripInfo& SecondaryGripInfo, const struct FTransform_NetQuantize& NewRelativeTransform);
		void Server_NotifySecondaryAttachmentChanged(unsigned char GripID, const struct FBPSecondaryGripInfo& SecondaryGripInfo);
		void Server_NotifyLocalGripRemoved(unsigned char GripID, const struct FTransform_NetQuantize& TransformAtDrop, const struct FVector_NetQuantize100& AngularVelocity, const struct FVector_NetQuantize100& LinearVelocity);
		void Server_NotifyLocalGripAddedOrChanged(const struct FBPActorGripInformation& newGrip);
		void Server_NotifyHandledTransaction(unsigned char GripID);
		void Server_NotifyDropAndSocketGrip(unsigned char GripID, class USceneComponent* SocketingParent, const class FName& OptionalSocketName, const struct FTransform_NetQuantize& RelativeTransformToParent, bool bWeldBodies);
		bool RemoveSecondaryAttachmentPoint(class UObject* GrippedObjectToRemoveAttachment, float LerpToTime);
		bool RemoveSecondaryAttachmentFromGripByID(unsigned char GripID, float LerpToTime);
		bool RemoveSecondaryAttachmentFromGrip(const struct FBPActorGripInformation& GripToRemoveAttachment, float LerpToTime);
		void PostTeleportMoveGrippedObjects();
		void OnRep_ReplicatedControllerTransform();
		void OnRep_LocalTransaction(TArray<struct FBPActorGripInformation> OriginalArrayState);
		void OnRep_LocallyGrippedObjects(TArray<struct FBPActorGripInformation> OriginalArrayState);
		void OnRep_GrippedObjects(TArray<struct FBPActorGripInformation> OriginalArrayState);
		void NotifyDropAndSocket(const struct FBPActorGripInformation& NewDrop, class USceneComponent* SocketingParent, const class FName& OptionalSocketName, const struct FTransform_NetQuantize& RelativeTransformToParent, bool bWeldBodies);
		void NotifyDrop(const struct FBPActorGripInformation& NewDrop, bool bSimulate);
		void NewControllerProfileLoaded();
		bool HasGrippedObjects();
		bool GripObjectByInterface(class UObject* ObjectToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const class FName& OptionalBoneToGripName, const class FName& OptionalSnapToSocketName, bool bIsSlotGrip);
		bool GripObject(class UObject* ObjectToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const class FName& OptionalSnapToSocketName, const class FName& OptionalBoneToGripName, EGripCollisionType GripCollisionType, EGripLateUpdateSettings GripLateUpdateSetting, EGripMovementReplicationSettings GripMovementReplicationSetting, float GripStiffness, float GripDamping, bool bIsSlotGrip);
		bool GripControllerIsTracked();
		bool GripComponent(class UPrimitiveComponent* ComponentToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const class FName& OptionalSnapToSocketName, const class FName& OptionalBoneToGripName, EGripCollisionType GripCollisionType, EGripLateUpdateSettings GripLateUpdateSetting, EGripMovementReplicationSettings GripMovementReplicationSetting, float GripStiffness, float GripDamping, bool bIsSlotGrip);
		bool GripActor(class AActor* ActorToGrip, const struct FTransform& WorldOffset, bool bWorldOffsetIsRelative, const class FName& OptionalSnapToSocketName, const class FName& OptionalBoneToGripName, EGripCollisionType GripCollisionType, EGripLateUpdateSettings GripLateUpdateSetting, EGripMovementReplicationSettings GripMovementReplicationSetting, float GripStiffness, float GripDamping, bool bIsSlotGrip);
		struct FTransform GetPivotTransform_BP();
		struct FVector GetPivotLocation_BP();
		void GetPhysicsVelocities(const struct FBPActorGripInformation& Grip, struct FVector* AngularVelocity, struct FVector* LinearVelocity);
		bool GetPhysicsHandleSettings(const struct FBPActorGripInformation& Grip, struct FBPAdvancedPhysicsHandleSettings* PhysicsHandleSettingsOut);
		bool GetPhysicsConstraintForce(const struct FBPActorGripInformation& Grip, struct FVector* AngularForce, struct FVector* LinearForce);
		bool GetIsSecondaryAttachment(class USceneComponent* ComponentToCheck, struct FBPActorGripInformation* Grip);
		bool GetIsObjectHeld(class UObject* ObjectToCheck);
		bool GetIsHeld(class AActor* ActorToCheck);
		bool GetIsComponentHeld(class UPrimitiveComponent* ComponentToCheck);
		void GetHandType(EControllerHand* hand);
		void GetGrippedObjects(TArray<class UObject*>* GrippedObjectsArray);
		void GetGrippedComponents(TArray<class UPrimitiveComponent*>* GrippedComponentsArray);
		void GetGrippedActors(TArray<class AActor*>* GrippedActorArray);
		void GetGripMass(const struct FBPActorGripInformation& Grip, float* Mass);
		bool GetGripDistance_BP(struct FBPActorGripInformation* Grip, const struct FVector& ExpectedLocation, float* CurrentDistance);
		void GetGripByObject(struct FBPActorGripInformation* Grip, class UObject* ObjectToLookForGrip, EBPVRResultSwitch* Result);
		void GetGripByID(struct FBPActorGripInformation* Grip, unsigned char IDToLookForGrip, EBPVRResultSwitch* Result);
		void GetGripByComponent(struct FBPActorGripInformation* Grip, class UPrimitiveComponent* ComponentToLookForGrip, EBPVRResultSwitch* Result);
		void GetGripByActor(struct FBPActorGripInformation* Grip, class AActor* ActorToLookForGrip, EBPVRResultSwitch* Result);
		void GetControllerDeviceID(struct FXRDeviceId* DeviceID, EBPVRResultSwitch* Result, bool bCheckOpenVROnly);
		int32_t GetAllGripsNumber();
		void GetAllGrips(TArray<struct FBPActorGripInformation>* GripArray);
		bool DropObjectByInterface(class UObject* ObjectToDrop, unsigned char GripIDToDrop, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
		bool DropObject(class UObject* ObjectToDrop, unsigned char GripIDToDrop, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
		bool DropGrip(const struct FBPActorGripInformation& Grip, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
		bool DropComponent(class UPrimitiveComponent* ComponentToDrop, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
		bool DropAndSocketObject(const struct FTransform_NetQuantize& RelativeTransformToParent, class UObject* ObjectToDrop, unsigned char GripIDToDrop, class USceneComponent* SocketingParent, const class FName& OptionalSocketName, bool bWeldBodies);
		bool DropAndSocketGrip(const struct FBPActorGripInformation& GripToDrop, class USceneComponent* SocketingParent, const class FName& OptionalSocketName, const struct FTransform_NetQuantize& RelativeTransformToParent, bool bWeldBodies);
		bool DropActor(class AActor* ActorToDrop, bool bSimulate, const struct FVector& OptionalAngularVelocity, const struct FVector& OptionalLinearVelocity);
		bool DestroyPhysicsHandle_BP(const struct FBPActorGripInformation& Grip);
		struct FTransform CreateGripRelativeAdditionTransform_BP(const struct FBPActorGripInformation& GripToSample, const struct FTransform& AdditionTransform, bool bGripRelative);
		struct FTransform ConvertToGripRelativeTransform(const struct FTransform& GrippedActorTransform, const struct FTransform& InTransform);
		struct FTransform ConvertToControllerRelativeTransform(const struct FTransform& InTransform);
		void Client_NotifyInvalidLocalGrip(class UObject* LocallyGrippedObject, unsigned char GripID);
		void CancelGlobalLerpToHand(unsigned char GripID);
		bool BP_IsLocallyControlled();
		bool BP_HasGripMovementAuthority(const struct FBPActorGripInformation& Grip);
		bool BP_HasGripAuthorityForObject(class UObject* ObjToCheck);
		bool BP_HasGripAuthority(const struct FBPActorGripInformation& Grip);
		bool AddSecondaryAttachmentToGripByID(unsigned char GripID, class USceneComponent* SecondaryPointComponent, const struct FTransform& OriginalTransform, bool bTransformIsAlreadyRelative, float LerpToTime, bool bIsSlotGrip, const class FName& SecondarySlotName);
		bool AddSecondaryAttachmentToGrip(const struct FBPActorGripInformation& GripToAddAttachment, class USceneComponent* SecondaryPointComponent, const struct FTransform& OriginalTransform, bool bTransformIsAlreadyRelative, float LerpToTime, bool bIsSlotGrip, const class FName& SecondarySlotName);
		bool AddSecondaryAttachmentPoint(class UObject* GrippedObjectToAddAttachment, class USceneComponent* SecondaryPointComponent, const struct FTransform& OriginalTransform, bool bTransformIsAlreadyRelative, float LerpToTime, bool bIsSlotGrip, const class FName& SecondarySlotName);
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableActor
	 * Size -> 0x0180 (FullSize[0x0400] - InheritedSize[0x0280])
	 */
	class AGrippableActor : public AActor
	{
	public:
		unsigned char                                              UnknownData_478S[0x10];                                  // 0x0280(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRepAttachmentWithWeld                              AttachmentWeldReplication;                               // 0x0290(0x0048) Net, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x02D8(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x02E8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x02F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x0308(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x0318(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O73S[0x8];                                   // 0x0328(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVRClientAuthReplicationData                        ClientAuthReplicationData;                               // 0x0330(0x0050) Edit, BlueprintVisible, Net, NoDestructor, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0380(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bAllowIgnoringAttachOnOwner;                             // 0x03A0(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x03A1(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D3AQ[0x6];                                   // 0x03A2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x03A8(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		void Server_GetClientAuthReplication(const struct FRepMovementVR& newMovement);
		void Server_EndClientAuthReplication();
		bool RemoveFromClientReplicationBucket();
		bool PollReplicationEvent();
		bool IsCurrentlyClientAuthThrowing();
		void CeaseReplicationBlocking();
		bool AddToClientReplicationBucket();
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableBoxComponent
	 * Size -> 0x00E0 (FullSize[0x0590] - InheritedSize[0x04B0])
	 */
	class UGrippableBoxComponent : public UBoxComponent
	{
	public:
		unsigned char                                              UnknownData_JDW3[0x8];                                   // 0x04B0(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x04B8(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x04C8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x04D8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x04E8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x04F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0508(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x0528(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReplicateMovement;                                      // 0x0529(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IMQR[0x6];                                   // 0x052A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x0530(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9DHG[0x8];                                   // 0x0588(0x0008) MISSED OFFSET (PADDING)

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableCapsuleComponent
	 * Size -> 0x00E0 (FullSize[0x0580] - InheritedSize[0x04A0])
	 */
	class UGrippableCapsuleComponent : public UCapsuleComponent
	{
	public:
		unsigned char                                              UnknownData_CWLS[0x10];                                  // 0x04A0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x04B0(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x04C0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x04D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x04E0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x04F0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0500(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x0520(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReplicateMovement;                                      // 0x0521(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3FZM[0x6];                                   // 0x0522(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x0528(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableCharacter
	 * Size -> 0x0018 (FullSize[0x0530] - InheritedSize[0x0518])
	 */
	class AGrippableCharacter : public ACharacter
	{
	public:
		class UGrippableSkeletalMeshComponent*                     GrippableMeshReference;                                  // 0x0518(0x0008) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                ViewOriginationSocket;                                   // 0x0520(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FEXZ[0x8];                                   // 0x0528(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.OptionalRepSkeletalMeshComponent
	 * Size -> 0x0000 (FullSize[0x0F00] - InheritedSize[0x0F00])
	 */
	class UOptionalRepSkeletalMeshComponent : public USkeletalMeshComponent
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableSkeletalMeshActor
	 * Size -> 0x0178 (FullSize[0x0480] - InheritedSize[0x0308])
	 */
	class AGrippableSkeletalMeshActor : public ASkeletalMeshActor
	{
	public:
		unsigned char                                              UnknownData_5IUE[0x10];                                  // 0x0308(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRepAttachmentWithWeld                              AttachmentWeldReplication;                               // 0x0318(0x0048) Net, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x0360(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x0370(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x0380(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x0390(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x03A0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FVRClientAuthReplicationData                        ClientAuthReplicationData;                               // 0x03B0(0x0050) Edit, BlueprintVisible, Net, NoDestructor, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0400(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bAllowIgnoringAttachOnOwner;                             // 0x0420(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x0421(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RS18[0x6];                                   // 0x0422(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x0428(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		void Server_GetClientAuthReplication(const struct FRepMovementVR& newMovement);
		void Server_EndClientAuthReplication();
		bool RemoveFromClientReplicationBucket();
		bool PollReplicationEvent();
		bool IsCurrentlyClientAuthThrowing();
		void CeaseReplicationBlocking();
		bool AddToClientReplicationBucket();
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableSkeletalMeshComponent
	 * Size -> 0x00E0 (FullSize[0x0FE0] - InheritedSize[0x0F00])
	 */
	class UGrippableSkeletalMeshComponent : public USkeletalMeshComponent
	{
	public:
		unsigned char                                              UnknownData_8OG7[0x8];                                   // 0x0F00(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x0F08(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x0F18(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x0F28(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x0F38(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x0F48(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0F58(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x0F78(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReplicateMovement;                                      // 0x0F79(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AP9S[0x6];                                   // 0x0F7A(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x0F80(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D2MU[0x8];                                   // 0x0FD8(0x0008) MISSED OFFSET (PADDING)

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableSphereComponent
	 * Size -> 0x00E0 (FullSize[0x0580] - InheritedSize[0x04A0])
	 */
	class UGrippableSphereComponent : public USphereComponent
	{
	public:
		unsigned char                                              UnknownData_AUOW[0x10];                                  // 0x04A0(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x04B0(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x04C0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x04D0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x04E0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x04F0(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0500(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x0520(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReplicateMovement;                                      // 0x0521(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_O6XX[0x6];                                   // 0x0522(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x0528(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.OptionalRepStaticMeshComponent
	 * Size -> 0x0010 (FullSize[0x0520] - InheritedSize[0x0510])
	 */
	class UOptionalRepStaticMeshComponent : public UStaticMeshComponent
	{
	public:
		bool                                                       bReplicateMovement;                                      // 0x0510(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KAJF[0xF];                                   // 0x0511(0x000F) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableStaticMeshActor
	 * Size -> 0x0180 (FullSize[0x0410] - InheritedSize[0x0290])
	 */
	class AGrippableStaticMeshActor : public AStaticMeshActor
	{
	public:
		unsigned char                                              UnknownData_H8JH[0x10];                                  // 0x0290(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FRepAttachmentWithWeld                              AttachmentWeldReplication;                               // 0x02A0(0x0048) Net, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x02E8(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x02F8(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x0308(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x0318(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x0328(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TU4A[0x8];                                   // 0x0338(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVRClientAuthReplicationData                        ClientAuthReplicationData;                               // 0x0340(0x0050) Edit, BlueprintVisible, Net, NoDestructor, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0390(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bAllowIgnoringAttachOnOwner;                             // 0x03B0(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x03B1(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RNOQ[0x6];                                   // 0x03B2(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x03B8(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		void Server_GetClientAuthReplication(const struct FRepMovementVR& newMovement);
		void Server_EndClientAuthReplication();
		bool RemoveFromClientReplicationBucket();
		bool PollReplicationEvent();
		bool IsCurrentlyClientAuthThrowing();
		void CeaseReplicationBlocking();
		bool AddToClientReplicationBucket();
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GrippableStaticMeshComponent
	 * Size -> 0x00E0 (FullSize[0x05F0] - InheritedSize[0x0510])
	 */
	class UGrippableStaticMeshComponent : public UStaticMeshComponent
	{
	public:
		unsigned char                                              UnknownData_RTE3[0x10];                                  // 0x0510(0x0010) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UVRGripScriptBase*>                           GripLogicScripts;                                        // 0x0520(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnGripped;                                               // 0x0530(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnDropped;                                               // 0x0540(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripAdded;                                    // 0x0550(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		class FScriptMulticastDelegate                             OnSecondaryGripRemoved;                                  // 0x0560(0x0010) ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic
		struct FGameplayTagContainer                               GameplayTags;                                            // 0x0570(0x0020) Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic
		bool                                                       bRepGripSettingsAndGameplayTags;                         // 0x0590(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bReplicateMovement;                                      // 0x0591(0x0001) Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_17WS[0x6];                                   // 0x0592(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FBPInterfaceProperties                              VRGripInterfaceSettings;                                 // 0x0598(0x0058) Edit, BlueprintVisible, Net, ContainsInstancedReference, NativeAccessSpecifierPublic

	public:
		void SetGripPriority(int32_t NewGripPriority);
		void SetDenyGripping(bool bDenyGripping);
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.VRGripScriptBase
	 * Size -> 0x0018 (FullSize[0x0040] - InheritedSize[0x0028])
	 */
	class UVRGripScriptBase : public UObject
	{
	public:
		unsigned char                                              UnknownData_1R1F[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       bIsActive;                                               // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EGSTransformOverrideType                                   WorldTransformOverrideType;                              // 0x0031(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDenyAutoDrop;                                           // 0x0032(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bForceDrop;                                              // 0x0033(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bDenyLateUpdates;                                        // 0x0034(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInjectPrePhysicsHandle;                                 // 0x0035(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bInjectPostPhysicsHandle;                                // 0x0036(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bCanEverTick;                                            // 0x0037(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bAllowTicking;                                           // 0x0038(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ZSZF[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		bool Wants_DenyTeleport(class UGripMotionControllerComponent* Controller);
		void SetTickEnabled(bool bTickEnabled);
		void OnSecondaryGripRelease(class UGripMotionControllerComponent* Controller, class USceneComponent* ReleasingSecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
		void OnSecondaryGrip(class UGripMotionControllerComponent* Controller, class USceneComponent* SecondaryGripComponent, const struct FBPActorGripInformation& GripInformation);
		void OnGripRelease(class UGripMotionControllerComponent* ReleasingController, const struct FBPActorGripInformation& GripInformation, bool bWasSocketed);
		void OnGrip(class UGripMotionControllerComponent* GrippingController, const struct FBPActorGripInformation& GripInformation);
		void OnEndPlay(EEndPlayReason EndPlayReason);
		void OnBeginPlay(class UObject* CallingOwner);
		bool IsServer();
		bool HasAuthority();
		bool GetWorldTransform(class UGripMotionControllerComponent* GrippingController, float DeltaTime, struct FTransform* WorldTransform, const struct FTransform& ParentTransform, struct FBPActorGripInformation* Grip, class AActor* Actor, class UPrimitiveComponent* Root, bool bRootHasInterface, bool bActorHasInterface, bool bIsForTeleport);
		struct FTransform GetParentTransform(bool bGetWorldTransform, const class FName& BoneName);
		class USceneComponent* GetParentSceneComp();
		class UObject* GetParent();
		class AActor* GetOwner();
		struct FTransform GetGripTransform(const struct FBPActorGripInformation& Grip, const struct FTransform& ParentTransform);
		class UVRGripScriptBase* GetGripScriptByClass(class UObject* WorldContextObject, class UClass* GripScriptClass, EBPVRResultSwitch* Result);
		void ForceGripToDrop();
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GS_Default
	 * Size -> 0x0000 (FullSize[0x0040] - InheritedSize[0x0040])
	 */
	class UGS_Default : public UVRGripScriptBase
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class VRExpansionPlugin.GS_ExtendedDefault
	 * Size -> 0x0020 (FullSize[0x0060] - InheritedSize[0x0040])
	 */
	class UGS_ExtendedDefault : public UGS_Default
	{
	public:
		bool                                                       bLimitGripScaling;                                       // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_I2YQ[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FVector_NetQuantize100                              MinimumGripScaling;                                      // 0x0044(0x000C) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
