#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.5.1
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.Construct
	 */
	struct UWBP_Block_Slots_C_Construct_Params
	{	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.RefreshList
	 */
	struct UWBP_Block_Slots_C_RefreshList_Params
	{	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.PreConstruct
	 */
	struct UWBP_Block_Slots_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.Update
	 */
	struct UWBP_Block_Slots_C_Update_Params
	{	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.BndEvt__Slot_1_K2Node_ComponentBoundEvent_0_OnSlotSelected__DelegateSignature
	 */
	struct UWBP_Block_Slots_C_BndEvt__Slot_1_K2Node_ComponentBoundEvent_0_OnSlotSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SlotNr;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.BndEvt__Slot_2_K2Node_ComponentBoundEvent_1_OnSlotSelected__DelegateSignature
	 */
	struct UWBP_Block_Slots_C_BndEvt__Slot_2_K2Node_ComponentBoundEvent_1_OnSlotSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SlotNr;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.BndEvt__Slot_3_K2Node_ComponentBoundEvent_2_OnSlotSelected__DelegateSignature
	 */
	struct UWBP_Block_Slots_C_BndEvt__Slot_3_K2Node_ComponentBoundEvent_2_OnSlotSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SlotNr;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.BndEvt__WBP_Block_Slots_Slot_4_K2Node_ComponentBoundEvent_3_OnSlotSelected__DelegateSignature
	 */
	struct UWBP_Block_Slots_C_BndEvt__WBP_Block_Slots_Slot_4_K2Node_ComponentBoundEvent_3_OnSlotSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SlotNr;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.ExecuteUbergraph_WBP_Block_Slots
	 */
	struct UWBP_Block_Slots_C_ExecuteUbergraph_WBP_Block_Slots_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function WBP_Block_Slots.WBP_Block_Slots_C.OnSelected__DelegateSignature
	 */
	struct UWBP_Block_Slots_C_OnSelected__DelegateSignature_Params
	{
	public:
		int32_t                                                    SlotNr;                                                  // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
