#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.4
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ABP_Human3.ABP_Human3_C.AnimGraph
	 */
	struct UABP_Human3_C_AnimGraph_Params
	{
	public:
		struct FPoseLink                                           AnimGraph;                                               // 0x0000(0x0010)  (Parm, OutParm, NoDestructor)
	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.Can Jump
	 */
	struct UABP_Human3_C_Can_Jump_Params
	{
	public:
		bool                                                       Should_Jump;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                                       bJumping;                                                // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_E33368A641B431A8403149AB1C4DE090
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_E33368A641B431A8403149AB1C4DE090_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_6CE45C8A466334DB1619FCBC81D3447F
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_6CE45C8A466334DB1619FCBC81D3447F_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_E83CF9C54AF9867B64E58DAE9C47271D
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_E83CF9C54AF9867B64E58DAE9C47271D_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_3E4CADFD4FAC2A81D6EA5EAC0BB7BF95
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_3E4CADFD4FAC2A81D6EA5EAC0BB7BF95_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_BlendListByBool_48D5116044A4871161628D842DA0B073
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_BlendListByBool_48D5116044A4871161628D842DA0B073_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_10BF7AA9443BC4A42D8BAD95B39C4790
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_10BF7AA9443BC4A42D8BAD95B39C4790_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_981133DC4B34EC3561DA90B36AB2F26A
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_981133DC4B34EC3561DA90B36AB2F26A_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_BlendListByBool_1C40E5EB4329DA2CC1946B83949B8506
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_BlendListByBool_1C40E5EB4329DA2CC1946B83949B8506_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_06F9706A4F938FA41A2065AD9734DDB2
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_06F9706A4F938FA41A2065AD9734DDB2_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_1EA8E03444C2E291FA16AC9C951D2C86
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_LayeredBoneBlend_1EA8E03444C2E291FA16AC9C951D2C86_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_477533B7425E55B968359FB4D1362AA1
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_477533B7425E55B968359FB4D1362AA1_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_1491590246755BD1D739039D25FF2EB3
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_1491590246755BD1D739039D25FF2EB3_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_48F7936640A86518F257859A07E8C5F0
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_48F7936640A86518F257859A07E8C5F0_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.BlueprintUpdateAnimation
	 */
	struct UABP_Human3_C_BlueprintUpdateAnimation_Params
	{
	public:
		float                                                      DeltaTimeX;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.AnimNotify_Jump
	 */
	struct UABP_Human3_C_AnimNotify_Jump_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.AnimNotify_IdleStart
	 */
	struct UABP_Human3_C_AnimNotify_IdleStart_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.AnimNotify_JogStart
	 */
	struct UABP_Human3_C_AnimNotify_JogStart_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.JumpPressed
	 */
	struct UABP_Human3_C_JumpPressed_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.FireWeapon
	 */
	struct UABP_Human3_C_FireWeapon_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.StartMeleeAttack
	 */
	struct UABP_Human3_C_StartMeleeAttack_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.Revive
	 */
	struct UABP_Human3_C_Revive_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.ReloadWeapon
	 */
	struct UABP_Human3_C_ReloadWeapon_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.HitReaction
	 */
	struct UABP_Human3_C_HitReaction_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.SetCrouch
	 */
	struct UABP_Human3_C_SetCrouch_Params
	{
	public:
		bool                                                       SetCrouch;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.Death
	 */
	struct UABP_Human3_C_Death_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.ChangeLocomotion
	 */
	struct UABP_Human3_C_ChangeLocomotion_Params
	{
	public:
		ELocomotionState                                           NewLocomotion;                                           // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_339A21BF401B114C9EEC38A0D0BF20CB
	 */
	struct UABP_Human3_C_EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Human3_AnimGraphNode_TransitionResult_339A21BF401B114C9EEC38A0D0BF20CB_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.BlueprintBeginPlay
	 */
	struct UABP_Human3_C_BlueprintBeginPlay_Params
	{	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.SetTrackPlayer
	 */
	struct UABP_Human3_C_SetTrackPlayer_Params
	{
	public:
		bool                                                       TrackPlayer;                                             // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.SetWeaponType
	 */
	struct UABP_Human3_C_SetWeaponType_Params
	{
	public:
		bool                                                       Pistol;                                                  // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function ABP_Human3.ABP_Human3_C.ExecuteUbergraph_ABP_Human3
	 */
	struct UABP_Human3_C_ExecuteUbergraph_ABP_Human3_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		unsigned char                                              UnknownData_BIGI[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
