#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.4
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum IntoTheRadius.EPRStatStatus
	 */
	enum class EPRStatStatus : uint8_t
	{
		End    = 0,
		Low    = 1,
		Normal = 2,
		MAX    = 3
	};

	/**
	 * Enum IntoTheRadius.EAwarenessLevel
	 */
	enum class EAwarenessLevel : uint8_t
	{
		None = 0,
		Low  = 1,
		High = 2,
		MAX  = 3
	};

	/**
	 * Enum IntoTheRadius.EWeaponBoltState
	 */
	enum class EWeaponBoltState : uint8_t
	{
		Closed   = 0,
		Rotating = 1,
		HalfWay  = 2,
		Sliding  = 3,
		Opened   = 4,
		MAX      = 5
	};

	/**
	 * Enum IntoTheRadius.ERadiusLeaderboard
	 */
	enum class ERadiusLeaderboard : uint8_t
	{
		None          = 0,
		Artifacts     = 1,
		LoreCassettes = 2,
		MAX           = 3
	};

	/**
	 * Enum IntoTheRadius.ERadiusAchievement
	 */
	enum class ERadiusAchievement : uint8_t
	{
		None                  = 0,
		FirstWeapon           = 1,
		FirstDeath            = 2,
		CompleteShootingRange = 3,
		CompleteIronman       = 4,
		ClimbCrane            = 5,
		KillFromDistance      = 6,
		KillWithBarrel        = 7,
		HitByStomper          = 8,
		CollectArtifacts      = 9,
		CollectLoreCassettes  = 10,
		MAX                   = 11
	};

	/**
	 * Enum IntoTheRadius.EOverlayState
	 */
	enum class EOverlayState : uint8_t
	{
		Default    = 0,
		Masculine  = 1,
		Feminine   = 2,
		Injured    = 3,
		HandsTied  = 4,
		Rifle      = 5,
		Pistol1H   = 6,
		Pistol2H   = 7,
		Bow        = 8,
		Torch      = 9,
		Binoculars = 10,
		Box        = 11,
		Barrel     = 12,
		MAX        = 13
	};

	/**
	 * Enum IntoTheRadius.EViewMode
	 */
	enum class EViewMode : uint8_t
	{
		ThirdPerson = 0,
		FirstPerson = 1,
		MAX         = 2
	};

	/**
	 * Enum IntoTheRadius.EMovementAction
	 */
	enum class EMovementAction : uint8_t
	{
		None       = 0,
		LowMantle  = 1,
		HighMantle = 2,
		Rolling    = 3,
		GettingUp  = 4,
		MAX        = 5
	};

	/**
	 * Enum IntoTheRadius.EMovementState
	 */
	enum class EMovementState : uint8_t
	{
		None     = 0,
		Grounded = 1,
		InAir    = 2,
		Mantling = 3,
		Ragdoll  = 4,
		MAX      = 5
	};

	/**
	 * Enum IntoTheRadius.EGait
	 */
	enum class EGait : uint8_t
	{
		Walking   = 0,
		Running   = 1,
		Sprinting = 2,
		MAX       = 3
	};

	/**
	 * Enum IntoTheRadius.EStance
	 */
	enum class EStance : uint8_t
	{
		Standing  = 0,
		Crouching = 1,
		MAX       = 2
	};

	/**
	 * Enum IntoTheRadius.ERotationMode
	 */
	enum class ERotationMode : uint8_t
	{
		VelocityDirection = 0,
		LookingDirection  = 1,
		Aiming            = 2,
		MAX               = 3
	};

	/**
	 * Enum IntoTheRadius.EGroundedEntryState
	 */
	enum class EGroundedEntryState : uint8_t
	{
		None = 0,
		Roll = 1,
		MAX  = 2
	};

	/**
	 * Enum IntoTheRadius.EHipsDirection
	 */
	enum class EHipsDirection : uint8_t
	{
		F   = 0,
		B   = 1,
		RF  = 2,
		RB  = 3,
		LF  = 4,
		LB  = 5,
		MAX = 6
	};

	/**
	 * Enum IntoTheRadius.EFootStepType
	 */
	enum class EFootStepType : uint8_t
	{
		Step      = 0,
		WalkOrRun = 1,
		Jump      = 2,
		Land      = 3,
		MAX       = 4
	};

	/**
	 * Enum IntoTheRadius.EBotMovementMode
	 */
	enum class EBotMovementMode : uint8_t
	{
		WalkIdle     = 0,
		CrouchIdle   = 1,
		Sprint       = 2,
		RunIdle      = 3,
		WalkAiming   = 4,
		CrouchAiming = 5,
		RunAiming    = 6,
		MAX          = 7
	};

	/**
	 * Enum IntoTheRadius.ENpcCombatState
	 */
	enum class ENpcCombatState : uint8_t
	{
		Uninitialized    = 0,
		InCombat         = 1,
		WaitingForCombat = 2,
		MAX              = 3
	};

	/**
	 * Enum IntoTheRadius.ENpcPointQueryType
	 */
	enum class ENpcPointQueryType : uint8_t
	{
		None     = 0,
		Cover    = 1,
		Shooting = 2,
		MAX      = 3
	};

	/**
	 * Enum IntoTheRadius.EEnemySenseType
	 */
	enum class EEnemySenseType : uint8_t
	{
		Reduced = 0,
		Normal  = 1,
		MAX     = 2
	};

	/**
	 * Enum IntoTheRadius.ETracersShowType
	 */
	enum class ETracersShowType : uint8_t
	{
		None    = 0,
		Enemies = 1,
		Player  = 2,
		All     = 3,
		MAX     = 4
	};

	/**
	 * Enum IntoTheRadius.EItemsDropType
	 */
	enum class EItemsDropType : uint8_t
	{
		Backpack = 0,
		All      = 1,
		MAX      = 2
	};

	/**
	 * Enum IntoTheRadius.EDifficultyType
	 */
	enum class EDifficultyType : uint8_t
	{
		None            = 0,
		HighlyDecreased = 1,
		Decreased       = 2,
		Normal          = 3,
		Increased       = 4,
		HighlyIncreased = 5,
		MAX             = 6
	};

	/**
	 * Enum IntoTheRadius.EPRGameDifficultyPreset
	 */
	enum class EPRGameDifficultyPreset : uint8_t
	{
		Easy   = 0,
		Normal = 1,
		Hard   = 2,
		Custom = 3,
		MAX    = 4
	};

	/**
	 * Enum IntoTheRadius.EHapticsCurve
	 */
	enum class EHapticsCurve : uint8_t
	{
		Interact   = 0,
		FirePistol = 1,
		Grab       = 2,
		MAX        = 3
	};

	/**
	 * Enum IntoTheRadius.EHapticsType
	 */
	enum class EHapticsType : uint8_t
	{
		None                    = 0,
		Death                   = 1,
		DistanceGrip_Left       = 2,
		DistanceGrip_Right      = 3,
		BulletHit               = 4,
		Climb_Left              = 5,
		Climb_Right             = 6,
		Ping_Left               = 7,
		Ping_Right              = 8,
		Recoil                  = 9,
		Heartbeat               = 10,
		BackpackTake            = 11,
		BackpackReturn          = 12,
		Eat                     = 13,
		Drink                   = 14,
		Smoke                   = 15,
		DamageAnomaly           = 16,
		DamageFall_Light        = 17,
		DamageFall_Heavy        = 18,
		DamageSlash_Front_Left  = 19,
		DamageSlash_Back_Left   = 20,
		DamageSlash_Front_Right = 21,
		DamageSlash_Back_Right  = 22,
		MAX                     = 23
	};

	/**
	 * Enum IntoTheRadius.ELevelManagerState
	 */
	enum class ELevelManagerState : uint8_t
	{
		Ready     = 0,
		Loading   = 1,
		Unloading = 2,
		MAX       = 3
	};

	/**
	 * Enum IntoTheRadius.EMissionType
	 */
	enum class EMissionType : uint8_t
	{
		Tutorial          = 0,
		Story             = 1,
		Generic           = 2,
		SpecialArtifacts  = 3,
		SpecialGenerators = 4,
		MAX               = 5
	};

	/**
	 * Enum IntoTheRadius.EMissionState
	 */
	enum class EMissionState : uint8_t
	{
		Ready      = 0,
		Briefing   = 1,
		Debriefing = 2,
		Executing  = 3,
		Successful = 4,
		Failed     = 5,
		Rejected   = 6,
		Missed     = 7,
		MAX        = 8
	};

	/**
	 * Enum IntoTheRadius.EMissionObjectiveImportance
	 */
	enum class EMissionObjectiveImportance : uint8_t
	{
		Primary   = 0,
		Secondary = 1,
		Hint      = 2,
		MAX       = 3
	};

	/**
	 * Enum IntoTheRadius.EPRHandPoseType
	 */
	enum class EPRHandPoseType : uint8_t
	{
		Primary          = 0,
		PrimaryTriggered = 1,
		PrimarySafety    = 2,
		Secondary        = 3,
		Throw            = 4,
		Slide            = 5,
		MAX              = 6
	};

	/**
	 * Enum IntoTheRadius.EPRHandPoseSaveType
	 */
	enum class EPRHandPoseSaveType : uint8_t
	{
		Tag                     = 0,
		StaticMeshComponentPath = 1,
		MAX                     = 2
	};

	/**
	 * Enum IntoTheRadius.EPRHandPoseNumber
	 */
	enum class EPRHandPoseNumber : uint8_t
	{
		Pose1  = 0,
		Pose2  = 1,
		Pose3  = 2,
		Pose4  = 3,
		Pose5  = 4,
		Pose6  = 5,
		Pose7  = 6,
		Pose8  = 7,
		Pose9  = 8,
		Pose10 = 9,
		Count  = 10,
		MAX    = 11
	};

	/**
	 * Enum IntoTheRadius.EPRHandPoseGeometryType
	 */
	enum class EPRHandPoseGeometryType : uint8_t
	{
		Point  = 0,
		Spline = 1,
		Count  = 2,
		MAX    = 3
	};

	/**
	 * Enum IntoTheRadius.ESpeedCoefficient
	 */
	enum class ESpeedCoefficient : uint8_t
	{
		Default      = 0,
		Anomaly      = 1,
		Tide         = 2,
		TutorialZone = 3,
		WaterPatch   = 4,
		MAX          = 5
	};

	/**
	 * Enum IntoTheRadius.ECharReappearWaitingReason
	 */
	enum class ECharReappearWaitingReason : uint8_t
	{
		None                 = 0,
		WaitForReappearDelay = 1,
		WaitForCoverSearch   = 2,
		WaitToLeaveView      = 3,
		MAX                  = 4
	};

	/**
	 * Enum IntoTheRadius.ECharDetailLevel
	 */
	enum class ECharDetailLevel : uint8_t
	{
		Normal         = 0,
		PendingDisable = 1,
		Disabled       = 2,
		MAX            = 3
	};

	/**
	 * Enum IntoTheRadius.ECharCommand
	 */
	enum class ECharCommand : uint8_t
	{
		Idle   = 0,
		Walk   = 1,
		Attack = 2,
		MAX    = 3
	};

	/**
	 * Enum IntoTheRadius.EInventoryMode
	 */
	enum class EInventoryMode : uint8_t
	{
		None     = 0,
		Normal   = 1,
		Dressing = 2,
		MAX      = 3
	};

	/**
	 * Enum IntoTheRadius.EPlayerTeleportAdjustType
	 */
	enum class EPlayerTeleportAdjustType : uint8_t
	{
		None                = 0,
		Location            = 1,
		LocationAndRotation = 2,
		MAX                 = 3
	};

	/**
	 * Enum IntoTheRadius.EDamageCategory
	 */
	enum class EDamageCategory : uint8_t
	{
		None          = 0,
		Physical      = 1,
		Anomaly       = 2,
		Environmental = 3,
		Technical     = 4,
		Gas           = 5,
		MAX           = 6
	};

	/**
	 * Enum IntoTheRadius.EWeaponInfoParameter
	 */
	enum class EWeaponInfoParameter : uint8_t
	{
		Damage      = 0,
		Recoil      = 1,
		Accuracy    = 2,
		FireRate    = 3,
		Reliability = 4,
		MAX         = 5
	};

	/**
	 * Enum IntoTheRadius.EWeaponFireMode
	 */
	enum class EWeaponFireMode : uint8_t
	{
		Safety   = 0,
		Single   = 1,
		FullAuto = 2,
		Burst3   = 3,
		MAX      = 4
	};

	/**
	 * Enum IntoTheRadius.EItemSlot
	 */
	enum class EItemSlot : uint8_t
	{
		None     = 0,
		Magazine = 1,
		Barrel   = 2,
		Stock    = 3,
		Rail_01  = 4,
		Rail_02  = 5,
		Rail_03  = 6,
		Rail_04  = 7,
		Slot_01  = 8,
		Slot_02  = 9,
		Slot_03  = 10,
		Slot_04  = 11,
		MAX      = 12
	};

	/**
	 * Enum IntoTheRadius.EPRSubtitleType
	 */
	enum class EPRSubtitleType : uint8_t
	{
		Record   = 0,
		Player   = 1,
		Katya    = 2,
		Presence = 3,
		Unknown  = 4,
		MAX      = 5
	};

	/**
	 * Enum IntoTheRadius.EMapMarker
	 */
	enum class EMapMarker : uint8_t
	{
		None             = 0,
		MissionStart     = 1,
		MissionPrimary   = 2,
		MissionSecondary = 3,
		MissionHint      = 4,
		LastDeath        = 5,
		LastCamp         = 6,
		Custom           = 7,
		PlayerPosition   = 8,
		GatePosition     = 9,
		GateShortcut     = 10,
		GateHub          = 11,
		MAX              = 12
	};

	/**
	 * Enum IntoTheRadius.EPlayerControlAction
	 */
	enum class EPlayerControlAction : uint8_t
	{
		InteractLeft      = 0,
		InteractRight     = 1,
		GrabLeft          = 2,
		GrabRight         = 3,
		Move              = 4,
		Turn              = 5,
		Sprint            = 6,
		Menu              = 7,
		FireSelectorLeft  = 8,
		FireSelectorRight = 9,
		EjectMagLeft      = 10,
		EjectMagRight     = 11,
		MAX               = 12
	};

	/**
	 * Enum IntoTheRadius.EStartupType
	 */
	enum class EStartupType : uint8_t
	{
		BuildShipping = 0,
		BuildDebug    = 1,
		EditorNormal  = 2,
		EditorCustom  = 3,
		MAX           = 4
	};

	/**
	 * Enum IntoTheRadius.EHandPose
	 */
	enum class EHandPose : uint8_t
	{
		Default                 = 0,
		Open                    = 1,
		CanGrab                 = 2,
		GrabFull                = 3,
		SolveFingers            = 4,
		ConfiguredPose          = 5,
		FingerPoint             = 6,
		FingerPressed           = 7,
		ConfiguredPoseSecondary = 8,
		ConfiguredTriggerPose   = 9,
		MAX                     = 10
	};

	/**
	 * Enum IntoTheRadius.EPRHand
	 */
	enum class EPRHand : uint8_t
	{
		Left  = 0,
		Right = 1,
		MAX   = 2
	};

	/**
	 * Enum IntoTheRadius.EPRPlatformType
	 */
	enum class EPRPlatformType : uint8_t
	{
		Unknown = 0,
		Oculus  = 1,
		Steam   = 2,
		Quest   = 3,
		MAX     = 4
	};

	/**
	 * Enum IntoTheRadius.EPRHmdDeviceType
	 */
	enum class EPRHmdDeviceType : uint8_t
	{
		Unknown     = 0,
		PIE         = 1,
		ValveIndex  = 2,
		Vive        = 3,
		ViveCosmos  = 4,
		Oculus      = 5,
		OculusRiftS = 6,
		WindowsMR   = 7,
		MAX         = 8
	};

	/**
	 * Enum IntoTheRadius.EPRControllerType
	 */
	enum class EPRControllerType : uint8_t
	{
		Unknown     = 0,
		Index       = 1,
		Vive        = 2,
		ViveCosmos  = 3,
		Rift        = 4,
		RiftS       = 5,
		NativeRift  = 6,
		NativeRiftS = 7,
		WMR         = 8,
		MAX         = 9
	};

	/**
	 * Enum IntoTheRadius.EPRGameModeState
	 */
	enum class EPRGameModeState : uint8_t
	{
		Init                    = 0,
		Ready                   = 1,
		TransitionUnloading     = 2,
		TransitionLoading       = 3,
		TransitionWaitingForPSO = 4,
		TransitionPreparing     = 5,
		TransitionStarting      = 6,
		MAX                     = 7
	};

	/**
	 * Enum IntoTheRadius.ERadiusCommonStatisticsType
	 */
	enum class ERadiusCommonStatisticsType : uint8_t
	{
		TimePlayed               = 0,
		FinishedMissions         = 1,
		CollectedArtifacts       = 2,
		CollectedCassettes       = 3,
		CollectedWeaponPrimary   = 4,
		CollectedWeaponSecondary = 5,
		MAX                      = 6
	};

	/**
	 * Enum IntoTheRadius.ESettingsValue
	 */
	enum class ESettingsValue : uint8_t
	{
		Low    = 0,
		Medium = 1,
		High   = 2,
		MAX    = 3
	};

	/**
	 * Enum IntoTheRadius.EGraphicsSettingsType
	 */
	enum class EGraphicsSettingsType : uint8_t
	{
		ViewDistance   = 0,
		ShadowQuality  = 1,
		FoliageDensity = 2,
		Effects        = 3,
		Textures       = 4,
		Geometry       = 5,
		MAX            = 6
	};

	/**
	 * Enum IntoTheRadius.EStorageDoorState
	 */
	enum class EStorageDoorState : uint8_t
	{
		Closed   = 0,
		Opened   = 1,
		Gripping = 2,
		Lerping  = 3,
		MAX      = 4
	};

	/**
	 * Enum IntoTheRadius.EJournalGroup
	 */
	enum class EJournalGroup : uint8_t
	{
		Letters   = 0,
		Pechorsk  = 1,
		Tapes     = 2,
		Tips      = 3,
		Radius    = 4,
		Enemies   = 5,
		Anomalies = 6,
		MAX       = 7
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct IntoTheRadius.RelevanceDescription
	 * Size -> 0x0018
	 */
	struct FRelevanceDescription
	{
	public:
		class URelevanceCriteriaDescription*                       Criteria;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class URelevanceActionDescription*>                 Actions;                                                 // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.NpcInfo
	 * Size -> 0x0028
	 */
	struct FNpcInfo
	{
	public:
		class ACharacter*                                          CharacterRef;                                            // 0x0000(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BSM4[0x20];                                  // 0x0008(0x0020) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.DistanceGripCandidate
	 * Size -> 0x0040
	 */
	struct FDistanceGripCandidate
	{
	public:
		unsigned char                                              UnknownData_QFXW[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class AGrippableStaticMeshActor*                           Actor;                                                   // 0x0008(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		class UPrimitiveComponent*                                 Component;                                               // 0x0010(0x0008) ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_47CJ[0x28];                                  // 0x0018(0x0028) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.PRTriggerConfig
	 * Size -> 0x0018
	 */
	struct FPRTriggerConfig
	{
	public:
		struct FGameplayTag                                        Trigger;                                                 // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UPRCondition*>                                Conditions;                                              // 0x0008(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.TideTriggerConfig
	 * Size -> 0x0030
	 */
	struct FTideTriggerConfig
	{
	public:
		TArray<class UPRCondition*>                                Conditions;                                              // 0x0000(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                TriggersToSet;                                           // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                TriggersToUnset;                                         // 0x0020(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.ConditionsList
	 * Size -> 0x0010
	 */
	struct FConditionsList
	{
	public:
		TArray<class UPRCondition*>                                Conditions;                                              // 0x0000(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.TutorialConfig
	 * Size -> 0x0018
	 */
	struct FTutorialConfig
	{
	public:
		int32_t                                                    PlayerLevel;                                             // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Reward;                                                  // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        TriggerTag;                                              // 0x0008(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        LevelTag;                                                // 0x0010(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.StartupConfig
	 * Size -> 0x0038
	 */
	struct FStartupConfig
	{
	public:
		int32_t                                                    Money;                                                   // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YUUX[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UPRItemConfig*>                               Items;                                                   // 0x0008(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                Triggers;                                                // 0x0018(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                OpenedLevels;                                            // 0x0028(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.NPCAwarenessValues
	 * Size -> 0x0010
	 */
	struct FNPCAwarenessValues
	{
	public:
		float                                                      NoiseFootsteps;                                          // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NoiseWeaponSounds;                                       // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      NoiseWeaponShot;                                         // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      DamageMultiplier;                                        // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.CloseCombatManagerEnemyGroup
	 * Size -> 0x0028
	 */
	struct FCloseCombatManagerEnemyGroup
	{
	public:
		int32_t                                                    MinEnemyAllowed;                                         // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WX5R[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTagContainer                               EnemyGroup;                                              // 0x0008(0x0020) Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.CloseCombatManagerConfig
	 * Size -> 0x0028
	 */
	struct FCloseCombatManagerConfig
	{
	public:
		bool                                                       bEnabled;                                                // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OZ5V[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      CloseRangeRadius;                                        // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      CircleOfInterestRadius;                                  // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      MinDistanceFromPlayerToReappear;                         // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      TeleportSearchRadius;                                    // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Budget;                                                  // 0x0014(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FCloseCombatManagerEnemyGroup>               EnemyGroups;                                             // 0x0018(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.PRLootTableConfig
	 * Size -> 0x0028
	 */
	struct FPRLootTableConfig
	{
	public:
		TArray<class UPRCondition*>                                Conditions;                                              // 0x0000(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic
		int32_t                                                    LootPoints;                                              // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X7PJ[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UDataTable*                                          LootTable;                                               // 0x0018(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ExcludeGeneration;                                       // 0x0020(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IIR9[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.ShopShowcaseSideConfig
	 * Size -> 0x0020
	 */
	struct FShopShowcaseSideConfig
	{
	public:
		class FString                                              Name;                                                    // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                Items;                                                   // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.MinMaxFloat
	 * Size -> 0x0008
	 */
	struct FMinMaxFloat
	{
	public:
		float                                                      Min;                                                     // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Max;                                                     // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.RadiusGameDifficulty
	 * Size -> 0x0010
	 */
	struct FRadiusGameDifficulty
	{
	public:
		bool                                                       SleepRestoreHealth;                                      // 0x0000(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       LocationOnMap;                                           // 0x0001(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ShowTips;                                                // 0x0002(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            Hunger;                                                  // 0x0003(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            EnemySense;                                              // 0x0004(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            EnemyHealth;                                             // 0x0005(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            EnemyDamage;                                             // 0x0006(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            EnemyCount;                                              // 0x0007(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EItemsDropType                                             ItemsDropType;                                           // 0x0008(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            ItemSellPrice;                                           // 0x0009(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            WeaponShotDamage;                                        // 0x000A(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            AnomalyDamage;                                           // 0x000B(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            AnomalyAmount;                                           // 0x000C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		ETracersShowType                                           ShowTracers;                                             // 0x000D(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            MissionMoneyReward;                                      // 0x000E(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EDifficultyType                                            TideTime;                                                // 0x000F(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.EnemySenseMultiplier
	 * Size -> 0x0010
	 */
	struct FEnemySenseMultiplier
	{
	public:
		float                                                      HearingRadiusRange;                                      // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SightDistanceRange;                                      // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SightAnglesHorizontal;                                   // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      SightAnglesVertical;                                     // 0x000C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.StringToTagsList
	 * Size -> 0x0020
	 */
	struct FStringToTagsList
	{
	public:
		class FString                                              Key;                                                     // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                List;                                                    // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.AmmoContainerData
	 * Size -> 0x0018
	 */
	struct FAmmoContainerData
	{
	public:
		TArray<struct FGameplayTag>                                Ammo;                                                    // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		struct FGameplayTag                                        ChamberAmmo;                                             // 0x0010(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.TagToTransformsList
	 * Size -> 0x0050
	 */
	struct FTagToTransformsList
	{
	public:
		TMap<struct FGameplayTag, struct FTransform>               List;                                                    // 0x0000(0x0050) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.GateInfo
	 * Size -> 0x0024
	 */
	struct FGateInfo
	{
	public:
		struct FGameplayTag                                        LeadsFrom;                                               // 0x0000(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        LeadsTo;                                                 // 0x0008(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        UnlockTrigger;                                           // 0x0010(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             LocationInLevel;                                         // 0x0018(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.MinimapMeshMappingConfig
	 * Size -> 0x0018
	 */
	struct FMinimapMeshMappingConfig
	{
	public:
		TArray<class UStaticMesh*>                                 appliedTo;                                               // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      Scale;                                                   // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       rotateToMesh;                                            // 0x0014(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_MUO6[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.MinimapFoliageMappingConfig
	 * Size -> 0x0018
	 */
	struct FMinimapFoliageMappingConfig
	{
	public:
		TArray<class UFoliageType*>                                appliedTo;                                               // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		float                                                      Scale;                                                   // 0x0010(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       rotateToMesh;                                            // 0x0014(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2NVF[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.MinimapCliffMappingConfig
	 * Size -> 0x0008
	 */
	struct FMinimapCliffMappingConfig
	{
	public:
		float                                                      scaleThreshold;                                          // 0x0000(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      scaleRatio;                                              // 0x0004(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.MissionsCategory
	 * Size -> 0x0030
	 */
	struct FMissionsCategory
	{
	public:
		struct FGameplayTag                                        CategoryID;                                              // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxSimultaneously;                                       // 0x0008(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       RestrictMaxSuccessfulPerTide;                            // 0x000C(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       OnceInALife;                                             // 0x000D(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_20TX[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<class UPRCondition*>                                Conditions;                                              // 0x0010(0x0010) Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		TArray<class UMissionNormalConfig*>                        CategoryMissions;                                        // 0x0020(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.TagToTagsList
	 * Size -> 0x0018
	 */
	struct FTagToTagsList
	{
	public:
		struct FGameplayTag                                        Tag;                                                     // 0x0000(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                List;                                                    // 0x0008(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.TagToItemConfigsList
	 * Size -> 0x0028
	 */
	struct FTagToItemConfigsList
	{
	public:
		struct FGameplayTag                                        Tag;                                                     // 0x0000(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UPRItemConfig*>                               Configs;                                                 // 0x0008(0x0010) Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		class FString                                              CustomUID;                                               // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.MissionTriggersConfig
	 * Size -> 0x0020
	 */
	struct FMissionTriggersConfig
	{
	public:
		TArray<struct FGameplayTag>                                TriggersToSet;                                           // 0x0000(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct FGameplayTag>                                TriggersToUnset;                                         // 0x0010(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.MissionRecord
	 * Size -> 0x0020
	 */
	struct FMissionRecord
	{
	public:
		class FString                                              ID;                                                      // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        Tag;                                                     // 0x0010(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        Weapon;                                                  // 0x0018(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.SpawnGameData
	 * Size -> 0x0050
	 */
	struct FSpawnGameData
	{
	public:
		class FString                                              InstanceId;                                              // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FGameplayTag                                        TypeID;                                                  // 0x0010(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1IAX[0x8];                                   // 0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          Transform;                                               // 0x0020(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.NPCGameData
	 * Size -> 0x0020 (FullSize[0x0070] - InheritedSize[0x0050])
	 */
	struct FNPCGameData : public FSpawnGameData
	{
	public:
		float                                                      Health;                                                  // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Awareness;                                               // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             POI;                                                     // 0x0058(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              Command;                                                 // 0x0064(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3005[0xB];                                   // 0x0065(0x000B) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.ItemDropInfo
	 * Size -> 0x0050
	 */
	struct FItemDropInfo
	{
	public:
		struct FGameplayTag                                        LevelTag;                                                // 0x0000(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4QGR[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FTransform                                          Transform;                                               // 0x0010(0x0030) Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		TArray<class FString>                                      ItemIdList;                                              // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.ShiftsPair
	 * Size -> 0x0060
	 */
	struct FShiftsPair
	{
	public:
		struct FTransform                                          LeftShift;                                               // 0x0000(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FTransform                                          RightShift;                                              // 0x0030(0x0030) Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.PRCleanTransform
	 * Size -> 0x0018
	 */
	struct FPRCleanTransform
	{
	public:
		struct FVector                                             Location;                                                // 0x0000(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             Rotation;                                                // 0x000C(0x000C) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.PRSplineData
	 * Size -> 0x0040
	 */
	struct FPRSplineData
	{
	public:
		struct FPRCleanTransform                                   SplineShift;                                             // 0x0000(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   HandShiftRelatedSpline;                                  // 0x0018(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		TArray<struct FSplinePoint>                                Points;                                                  // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.PRHandPoseConditions
	 * Size -> 0x0004
	 */
	struct FPRHandPoseConditions
	{
	public:
		float                                                      MaxDistanceForGrip;                                      // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.PRHandPoseInfo
	 * Size -> 0x0140
	 */
	struct FPRHandPoseInfo
	{
	public:
		TMap<EPRControllerType, struct FPRCleanTransform>          ItemShiftPerController;                                  // 0x0000(0x0050) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   HandShift;                                               // 0x0050(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   PointShift;                                              // 0x0068(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRSplineData                                       SplineData;                                              // 0x0080(0x0040) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FPRHandPoseConditions                               HandPoseConditions;                                      // 0x00C0(0x0004) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   FingerThumbShift;                                        // 0x00C4(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   FingerIndexShift;                                        // 0x00DC(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   FingerMiddleShift;                                       // 0x00F4(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   FingerRingShift;                                         // 0x010C(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		struct FPRCleanTransform                                   FingerPinkyShift;                                        // 0x0124(0x0018) Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5P43[0x4];                                   // 0x013C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.PRHandPoseInfosPair
	 * Size -> 0x02A8 (FullSize[0x02B0] - InheritedSize[0x0008])
	 */
	struct FPRHandPoseInfosPair : public FTableRowBase
	{
	public:
		EPRHandPoseSaveType                                        SaveType;                                                // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPRHandPoseNumber                                          PoseNumber;                                              // 0x0009(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		EPRHandPoseGeometryType                                    GeometryType;                                            // 0x000A(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_54DZ[0x1];                                   // 0x000B(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FGameplayTag                                        PoseTag;                                                 // 0x000C(0x0008) Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_JC8K[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              StaticMeshComponentPath;                                 // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                StaticMeshComponentName;                                 // 0x0028(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FPRHandPoseInfo                                     Left;                                                    // 0x0030(0x0140) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		struct FPRHandPoseInfo                                     Right;                                                   // 0x0170(0x0140) Edit, BlueprintVisible, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.ActorsArray
	 * Size -> 0x0058
	 */
	struct FActorsArray
	{
	public:
		TArray<class AActor*>                                      Actors;                                                  // 0x0000(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		TArray<bool>                                               InUseFlags;                                              // 0x0010(0x0010) ZeroConstructor, NativeAccessSpecifierPrivate
		unsigned char                                              UnknownData_UJMW[0x8];                                   // 0x0020(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UObject*                                             WorldContext;                                            // 0x0028(0x0008) ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WI22[0x28];                                  // 0x0030(0x0028) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.PoolActorConfig
	 * Size -> 0x0028
	 */
	struct FPoolActorConfig
	{
	public:
		class UClass*                                              ActorClass;                                              // 0x0000(0x0008) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<EPRPlatformType>                                    PlatformTypes;                                           // 0x0008(0x0010) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    InitCount;                                               // 0x0018(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MaxCount;                                                // 0x001C(0x0004) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       ReCreateOnDestroy;                                       // 0x0020(0x0001) Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V9Q2[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.NPCAwarenessConfig
	 * Size -> 0x0010 (FullSize[0x0018] - InheritedSize[0x0008])
	 */
	struct FNPCAwarenessConfig : public FTableRowBase
	{
	public:
		float                                                      AwarenessLowLevel;                                       // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AwarenessHighLevel;                                      // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AwarenessDecrease;                                       // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5X3W[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct IntoTheRadius.NPCIdleConfig
	 * Size -> 0x0050 (FullSize[0x0058] - InheritedSize[0x0008])
	 */
	struct FNPCIdleConfig : public FTableRowBase
	{
	public:
		struct FMinMaxFloat                                        WalkSpeedRange;                                          // 0x0008(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FMinMaxFloat                                        IdleTimeRange;                                           // 0x0010(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		struct FMinMaxFloat                                        RotationSpeedRange;                                      // 0x0018(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		bool                                                       LookAroundAfterWalk;                                     // 0x0020(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E3HT[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FNPCAwarenessConfig                                 AwarenessConfig;                                         // 0x0028(0x0018) Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic
		struct FNPCAwarenessConfig                                 ReducedAwarenessConfig;                                  // 0x0040(0x0018) Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct IntoTheRadius.NPCSightConfig
	 * Size -> 0x0018 (FullSize[0x0020] - InheritedSize[0x0008])
	 */
	struct FNPCSightConfig : public FTableRowBase
	{
	public:
		struct FMinMaxFloat                                        DistanceRange;                                           // 0x0008(0x0008) Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic
		float                                                      AngleLeft;                                               // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AngleRight;                                              // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      AngleUp;                                                 // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
