#pragma once

/**
 * Name: Into_The_Radius_VR
 * Version: 2.4
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function VRExpansionPlugin.BucketUpdateSubsystem.RemoveObjectFromBucketByFunctionName
	 */
	struct UBucketUpdateSubsystem_RemoveObjectFromBucketByFunctionName_Params
	{
	public:
		class UObject*                                             InObject;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                FunctionName;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.BucketUpdateSubsystem.RemoveObjectFromBucketByEvent
	 */
	struct UBucketUpdateSubsystem_RemoveObjectFromBucketByEvent_Params
	{
	public:
		class FScriptDelegate                                      Delegate;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.BucketUpdateSubsystem.RemoveObjectFromAllBuckets
	 */
	struct UBucketUpdateSubsystem_RemoveObjectFromAllBuckets_Params
	{
	public:
		class UObject*                                             InObject;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.BucketUpdateSubsystem.K2_AddObjectToBucket
	 */
	struct UBucketUpdateSubsystem_K2_AddObjectToBucket_Params
	{
	public:
		int32_t                                                    UpdateHTZ;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_D6SV[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class UObject*                                             InObject;                                                // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                FunctionName;                                            // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.BucketUpdateSubsystem.K2_AddObjectEventToBucket
	 */
	struct UBucketUpdateSubsystem_K2_AddObjectEventToBucket_Params
	{
	public:
		class FScriptDelegate                                      Delegate;                                                // 0x0000(0x0010)  (Parm, ZeroConstructor, NoDestructor, NativeAccessSpecifierPublic)
		int32_t                                                    UpdateHTZ;                                               // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0014(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.BucketUpdateSubsystem.IsObjectFunctionInBucket
	 */
	struct UBucketUpdateSubsystem_IsObjectFunctionInBucket_Params
	{
	public:
		class UObject*                                             InObject;                                                // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                FunctionName;                                            // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.BucketUpdateSubsystem.IsActive
	 */
	struct UBucketUpdateSubsystem_IsActive_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.UpdatePhysicsHandleTransform_BP
	 */
	struct UGripMotionControllerComponent_UpdatePhysicsHandleTransform_BP_Params
	{
	public:
		struct FBPActorGripInformation                             GrippedActor;                                            // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		struct FTransform                                          NewTransform;                                            // 0x01E0(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.UpdatePhysicsHandle_BP
	 */
	struct UGripMotionControllerComponent_UpdatePhysicsHandle_BP_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		bool                                                       bFullyRecreate;                                          // 0x01E0(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x01E1(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.TeleportMoveGrips
	 */
	struct UGripMotionControllerComponent_TeleportMoveGrips_Params
	{
	public:
		bool                                                       bTeleportPhysicsGrips;                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsForPostTeleport;                                      // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.TeleportMoveGrippedComponent
	 */
	struct UGripMotionControllerComponent_TeleportMoveGrippedComponent_Params
	{
	public:
		class UPrimitiveComponent*                                 ComponentToMove;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bTeleportPhysicsGrips;                                   // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.TeleportMoveGrippedActor
	 */
	struct UGripMotionControllerComponent_TeleportMoveGrippedActor_Params
	{
	public:
		class AActor*                                              GrippedActorToMove;                                      // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bTeleportPhysicsGrips;                                   // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0009(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.TeleportMoveGrip
	 */
	struct UGripMotionControllerComponent_TeleportMoveGrip_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		bool                                                       bTeleportPhysicsGrips;                                   // 0x01E0(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsForPostTeleport;                                      // 0x01E1(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x01E2(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetUpPhysicsHandle_BP
	 */
	struct UGripMotionControllerComponent_SetUpPhysicsHandle_BP_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetSocketTransform
	 */
	struct UGripMotionControllerComponent_SetSocketTransform_Params
	{
	public:
		class UObject*                                             ObjectToSocket;                                          // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_2NMR[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform_NetQuantize                              RelativeTransformToParent;                               // 0x0010(0x0030)  (ConstParm, Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetPhysicsHandleSettings
	 */
	struct UGripMotionControllerComponent_SetPhysicsHandleSettings_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		struct FBPAdvancedPhysicsHandleSettings                    PhysicsHandleSettingsIn;                                 // 0x01E0(0x0060)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0240(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetPausedTransform
	 */
	struct UGripMotionControllerComponent_SetPausedTransform_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		struct FTransform                                          PausedTransform;                                         // 0x01E0(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bTeleport;                                               // 0x0210(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetGripStiffnessAndDamping
	 */
	struct UGripMotionControllerComponent_SetGripStiffnessAndDamping_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		EBPVRResultSwitch                                          Result;                                                  // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_VMAI[0x3];                                   // 0x01E1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      NewStiffness;                                            // 0x01E4(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      NewDamping;                                              // 0x01E8(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bAlsoSetAngularValues;                                   // 0x01EC(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_13IL[0x3];                                   // 0x01ED(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      OptionalAngularStiffness;                                // 0x01F0(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      OptionalAngularDamping;                                  // 0x01F4(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetGripRelativeTransform
	 */
	struct UGripMotionControllerComponent_SetGripRelativeTransform_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		EBPVRResultSwitch                                          Result;                                                  // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_AR7O[0xF];                                   // 0x01E1(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          NewRelativeTransform;                                    // 0x01F0(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetGripPaused
	 */
	struct UGripMotionControllerComponent_SetGripPaused_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		EBPVRResultSwitch                                          Result;                                                  // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsPaused;                                               // 0x01E1(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bNoConstraintWhenPaused;                                 // 0x01E2(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetGripLateUpdateSetting
	 */
	struct UGripMotionControllerComponent_SetGripLateUpdateSetting_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		EBPVRResultSwitch                                          Result;                                                  // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripLateUpdateSettings                                    NewGripLateUpdateSetting;                                // 0x01E1(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetGripHybridLock
	 */
	struct UGripMotionControllerComponent_SetGripHybridLock_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		EBPVRResultSwitch                                          Result;                                                  // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsLocked;                                               // 0x01E1(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetGripCollisionType
	 */
	struct UGripMotionControllerComponent_SetGripCollisionType_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		EBPVRResultSwitch                                          Result;                                                  // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripCollisionType                                         NewGripCollisionType;                                    // 0x01E1(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetGripAdditionTransform
	 */
	struct UGripMotionControllerComponent_SetGripAdditionTransform_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		EBPVRResultSwitch                                          Result;                                                  // 0x01E0(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_2WKD[0xF];                                   // 0x01E1(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          NewAdditionTransform;                                    // 0x01F0(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bMakeGripRelative;                                       // 0x0220(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.SetCustomPivotComponent
	 */
	struct UGripMotionControllerComponent_SetCustomPivotComponent_Params
	{
	public:
		class USceneComponent*                                     NewCustomPivotComponent;                                 // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                PivotSocketName;                                         // 0x0008(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.Server_SendControllerTransform
	 */
	struct UGripMotionControllerComponent_Server_SendControllerTransform_Params
	{
	public:
		struct FBPVRComponentPosRep                                NewTransform;                                            // 0x0000(0x001C)  (Parm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.Server_NotifySecondaryAttachmentChanged_Retain
	 */
	struct UGripMotionControllerComponent_Server_NotifySecondaryAttachmentChanged_Retain_Params
	{
	public:
		unsigned char                                              GripID;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_4V3G[0xF];                                   // 0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FBPSecondaryGripInfo                                SecondaryGripInfo;                                       // 0x0010(0x0070)  (ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		struct FTransform_NetQuantize                              NewRelativeTransform;                                    // 0x0080(0x0030)  (ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.Server_NotifySecondaryAttachmentChanged
	 */
	struct UGripMotionControllerComponent_Server_NotifySecondaryAttachmentChanged_Params
	{
	public:
		unsigned char                                              GripID;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_K67W[0xF];                                   // 0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FBPSecondaryGripInfo                                SecondaryGripInfo;                                       // 0x0010(0x0070)  (ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.Server_NotifyLocalGripRemoved
	 */
	struct UGripMotionControllerComponent_Server_NotifyLocalGripRemoved_Params
	{
	public:
		unsigned char                                              GripID;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_RDPJ[0xF];                                   // 0x0001(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform_NetQuantize                              TransformAtDrop;                                         // 0x0010(0x0030)  (ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize100                              AngularVelocity;                                         // 0x0040(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector_NetQuantize100                              LinearVelocity;                                          // 0x004C(0x000C)  (Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.Server_NotifyLocalGripAddedOrChanged
	 */
	struct UGripMotionControllerComponent_Server_NotifyLocalGripAddedOrChanged_Params
	{
	public:
		struct FBPActorGripInformation                             newGrip;                                                 // 0x0000(0x01E0)  (ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.Server_NotifyHandledTransaction
	 */
	struct UGripMotionControllerComponent_Server_NotifyHandledTransaction_Params
	{
	public:
		unsigned char                                              GripID;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.Server_NotifyDropAndSocketGrip
	 */
	struct UGripMotionControllerComponent_Server_NotifyDropAndSocketGrip_Params
	{
	public:
		unsigned char                                              GripID;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_FOUF[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class USceneComponent*                                     SocketingParent;                                         // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                OptionalSocketName;                                      // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_YRHS[0x8];                                   // 0x0018(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform_NetQuantize                              RelativeTransformToParent;                               // 0x0020(0x0030)  (ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bWeldBodies;                                             // 0x0050(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.RemoveSecondaryAttachmentPoint
	 */
	struct UGripMotionControllerComponent_RemoveSecondaryAttachmentPoint_Params
	{
	public:
		class UObject*                                             GrippedObjectToRemoveAttachment;                         // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      LerpToTime;                                              // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x000C(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.RemoveSecondaryAttachmentFromGripByID
	 */
	struct UGripMotionControllerComponent_RemoveSecondaryAttachmentFromGripByID_Params
	{
	public:
		unsigned char                                              GripID;                                                  // 0x0000(0x0001)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_H02P[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      LerpToTime;                                              // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.RemoveSecondaryAttachmentFromGrip
	 */
	struct UGripMotionControllerComponent_RemoveSecondaryAttachmentFromGrip_Params
	{
	public:
		struct FBPActorGripInformation                             GripToRemoveAttachment;                                  // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		float                                                      LerpToTime;                                              // 0x01E0(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x01E4(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.PostTeleportMoveGrippedObjects
	 */
	struct UGripMotionControllerComponent_PostTeleportMoveGrippedObjects_Params
	{	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.OnRep_ReplicatedControllerTransform
	 */
	struct UGripMotionControllerComponent_OnRep_ReplicatedControllerTransform_Params
	{	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.OnRep_LocalTransaction
	 */
	struct UGripMotionControllerComponent_OnRep_LocalTransaction_Params
	{
	public:
		TArray<struct FBPActorGripInformation>                     OriginalArrayState;                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.OnRep_LocallyGrippedObjects
	 */
	struct UGripMotionControllerComponent_OnRep_LocallyGrippedObjects_Params
	{
	public:
		TArray<struct FBPActorGripInformation>                     OriginalArrayState;                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.OnRep_GrippedObjects
	 */
	struct UGripMotionControllerComponent_OnRep_GrippedObjects_Params
	{
	public:
		TArray<struct FBPActorGripInformation>                     OriginalArrayState;                                      // 0x0000(0x0010)  (Parm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.NotifyDropAndSocket
	 */
	struct UGripMotionControllerComponent_NotifyDropAndSocket_Params
	{
	public:
		struct FBPActorGripInformation                             NewDrop;                                                 // 0x0000(0x01E0)  (ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		class USceneComponent*                                     SocketingParent;                                         // 0x01E0(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                OptionalSocketName;                                      // 0x01E8(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FTransform_NetQuantize                              RelativeTransformToParent;                               // 0x01F0(0x0030)  (ConstParm, Parm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bWeldBodies;                                             // 0x0220(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.NotifyDrop
	 */
	struct UGripMotionControllerComponent_NotifyDrop_Params
	{
	public:
		struct FBPActorGripInformation                             NewDrop;                                                 // 0x0000(0x01E0)  (ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		bool                                                       bSimulate;                                               // 0x01E0(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.NewControllerProfileLoaded
	 */
	struct UGripMotionControllerComponent_NewControllerProfileLoaded_Params
	{	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.HasGrippedObjects
	 */
	struct UGripMotionControllerComponent_HasGrippedObjects_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GripObjectByInterface
	 */
	struct UGripMotionControllerComponent_GripObjectByInterface_Params
	{
	public:
		class UObject*                                             ObjectToGrip;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_XZBN[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          WorldOffset;                                             // 0x0010(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bWorldOffsetIsRelative;                                  // 0x0040(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_A1CZ[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                OptionalBoneToGripName;                                  // 0x0044(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                OptionalSnapToSocketName;                                // 0x004C(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsSlotGrip;                                             // 0x0054(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0055(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GripObject
	 */
	struct UGripMotionControllerComponent_GripObject_Params
	{
	public:
		class UObject*                                             ObjectToGrip;                                            // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_IJTI[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          WorldOffset;                                             // 0x0010(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bWorldOffsetIsRelative;                                  // 0x0040(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_R104[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                OptionalSnapToSocketName;                                // 0x0044(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                OptionalBoneToGripName;                                  // 0x004C(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripCollisionType                                         GripCollisionType;                                       // 0x0054(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripLateUpdateSettings                                    GripLateUpdateSetting;                                   // 0x0055(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripMovementReplicationSettings                           GripMovementReplicationSetting;                          // 0x0056(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_VPXM[0x1];                                   // 0x0057(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      GripStiffness;                                           // 0x0058(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      GripDamping;                                             // 0x005C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsSlotGrip;                                             // 0x0060(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0061(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GripControllerIsTracked
	 */
	struct UGripMotionControllerComponent_GripControllerIsTracked_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GripComponent
	 */
	struct UGripMotionControllerComponent_GripComponent_Params
	{
	public:
		class UPrimitiveComponent*                                 ComponentToGrip;                                         // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_8AHW[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          WorldOffset;                                             // 0x0010(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bWorldOffsetIsRelative;                                  // 0x0040(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_813B[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                OptionalSnapToSocketName;                                // 0x0044(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                OptionalBoneToGripName;                                  // 0x004C(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripCollisionType                                         GripCollisionType;                                       // 0x0054(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripLateUpdateSettings                                    GripLateUpdateSetting;                                   // 0x0055(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripMovementReplicationSettings                           GripMovementReplicationSetting;                          // 0x0056(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_DESA[0x1];                                   // 0x0057(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      GripStiffness;                                           // 0x0058(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      GripDamping;                                             // 0x005C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsSlotGrip;                                             // 0x0060(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0061(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GripActor
	 */
	struct UGripMotionControllerComponent_GripActor_Params
	{
	public:
		class AActor*                                              ActorToGrip;                                             // 0x0000(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_MCE1[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FTransform                                          WorldOffset;                                             // 0x0010(0x0030)  (ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       bWorldOffsetIsRelative;                                  // 0x0040(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_SAUI[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		class FName                                                OptionalSnapToSocketName;                                // 0x0044(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                OptionalBoneToGripName;                                  // 0x004C(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripCollisionType                                         GripCollisionType;                                       // 0x0054(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripLateUpdateSettings                                    GripLateUpdateSetting;                                   // 0x0055(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EGripMovementReplicationSettings                           GripMovementReplicationSetting;                          // 0x0056(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_EMIT[0x1];                                   // 0x0057(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		float                                                      GripStiffness;                                           // 0x0058(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      GripDamping;                                             // 0x005C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bIsSlotGrip;                                             // 0x0060(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0061(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetPivotTransform_BP
	 */
	struct UGripMotionControllerComponent_GetPivotTransform_BP_Params
	{
	public:
		struct FTransform                                          ReturnValue;                                             // 0x0000(0x0030)  (Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetPivotLocation_BP
	 */
	struct UGripMotionControllerComponent_GetPivotLocation_BP_Params
	{
	public:
		struct FVector                                             ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetPhysicsVelocities
	 */
	struct UGripMotionControllerComponent_GetPhysicsVelocities_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		struct FVector                                             AngularVelocity;                                         // 0x01E0(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             LinearVelocity;                                          // 0x01EC(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetPhysicsHandleSettings
	 */
	struct UGripMotionControllerComponent_GetPhysicsHandleSettings_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		struct FBPAdvancedPhysicsHandleSettings                    PhysicsHandleSettingsOut;                                // 0x01E0(0x0060)  (Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0240(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetPhysicsConstraintForce
	 */
	struct UGripMotionControllerComponent_GetPhysicsConstraintForce_Params
	{
	public:
		struct FBPActorGripInformation                             Grip;                                                    // 0x0000(0x01E0)  (ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		struct FVector                                             AngularForce;                                            // 0x01E0(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FVector                                             LinearForce;                                             // 0x01EC(0x000C)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x01F8(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetIsSecondaryAttachment
	 */
	struct UGripMotionControllerComponent_GetIsSecondaryAttachment_Params
	{
	public:
		class USceneComponent*                                     ComponentToCheck;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		unsigned char                                              UnknownData_6DMH[0x8];                                   // 0x0008(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY) ()
		struct FBPActorGripInformation                             Grip;                                                    // 0x0010(0x01E0)  (Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x01F0(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetIsObjectHeld
	 */
	struct UGripMotionControllerComponent_GetIsObjectHeld_Params
	{
	public:
		class UObject*                                             ObjectToCheck;                                           // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetIsHeld
	 */
	struct UGripMotionControllerComponent_GetIsHeld_Params
	{
	public:
		class AActor*                                              ActorToCheck;                                            // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetIsComponentHeld
	 */
	struct UGripMotionControllerComponent_GetIsComponentHeld_Params
	{
	public:
		class UPrimitiveComponent*                                 ComponentToCheck;                                        // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0008(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetHandType
	 */
	struct UGripMotionControllerComponent_GetHandType_Params
	{
	public:
		EControllerHand                                            hand;                                                    // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetGrippedObjects
	 */
	struct UGripMotionControllerComponent_GetGrippedObjects_Params
	{
	public:
		TArray<class UObject*>                                     GrippedObjectsArray;                                     // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetGrippedComponents
	 */
	struct UGripMotionControllerComponent_GetGrippedComponents_Params
	{
	public:
		TArray<class UPrimitiveComponent*>                         GrippedComponentsArray;                                  // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetGrippedActors
	 */
	struct UGripMotionControllerComponent_GetGrippedActors_Params
	{
	public:
		TArray<class AActor*>                                      GrippedActorArray;                                       // 0x0000(0x0010)  (Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function VRExpansionPlugin.GripMotionControllerComponent.GetGripMass
	 */
	struct UGripMotionControllerComponent_GetGripMass_Params
	{
	public:
